// ----------------------------------------------
// Система управления инженерными данными 1С:PDM
// -----------------------------------------------
// Разработка компании Appius, www.appius.ru
// -----------------------------------------------

#Область ОписаниеПеременных

#Если Сервер Тогда 
Перем aps_СтруктураПараметровОповещенияНаСервере Экспорт; // Описание структуры параметров событий/оповещений 1C:PDM на сервере
#КонецЕсли

#КонецОбласти


#Область ПрограммныйИнтерфейс

#Если Не МобильноеПриложениеСервер Тогда 

// Устанавливает определенный вид для создания
//
// Параметры
//			ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов
//
Процедура aps_УстановитьСозданиеОпределенногоВида( ВидЭлемента ) Экспорт
	ВидыДляСоздания.Очистить();
	ВидыДляСоздания.Добавить().ВидДляСоздания = ВидЭлемента;
КонецПроцедуры

// Устанавливает для данного вида подчиненные виды для создания
//
// Параметры
//			ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов
//
Процедура aps_УстановитьСозданиеПодчиненныхВидов( ВидЭлемента ) Экспорт 
	ВидыДляСоздания.Очистить();
	
	МассивВидов = aps_ПолучитьПодчиненныеВиды( ВидЭлемента );
	Для Каждого ВидСсылка Из МассивВидов Цикл 
		ВидыДляСоздания.Добавить().ВидДляСоздания = ВидСсылка;
	КонецЦикла;
КонецПроцедуры

// Получает дерево допустимых видов элементов в данном контексте
//
// Параметры
//			Дерево - ДеревоЗначений, дерево создаваемых видов
//
Процедура aps_ОбновитьДеревоСоздаваемыхВидов( Дерево ) Экспорт 
	
	ЗапросВидов = Новый Запрос();
	ЗапросВидов.Текст = "ВЫБРАТЬ
	                    |	aps_ВидыЭлементов.Ссылка КАК ВидЭлемента,
						|	aps_ВидыЭлементов.ЭтоГруппа КАК ЭтоГруппа,
	                    |	ВЫБОР
	                    |		КОГДА aps_ВидыЭлементов.ЭтоГруппа
	                    |			ТОГДА &ИндексКартинкиПапки
	                    |		ИНАЧЕ aps_ВидыЭлементов.ИндексКартинки
	                    |	КОНЕЦ КАК ИндексКартинки
	                    |ИЗ
	                    |	Справочник.aps_ВидыЭлементов КАК aps_ВидыЭлементов
	                    |ГДЕ
	                    |	(НЕ aps_ВидыЭлементов.ПометкаУдаления)
	                    |	И (НЕ aps_ВидыЭлементов.Служебный)";
	Если ВидыДляСоздания.Количество() > 0 Тогда
		ЗапросВидов.Текст = ЗапросВидов.Текст + "
						|	И aps_ВидыЭлементов.Ссылка В(&ПарамВиды)";
						
		// Установка отбора по видам
		МассивВидовОтбор = ВидыДляСоздания.ВыгрузитьКолонку("ВидДляСоздания");
		Для Каждого ВидСсылка Из МассивВидовОтбор Цикл 
			РодительВида = ВидСсылка;
			Пока НЕ РодительВида.Пустая() Цикл 
				Если МассивВидовОтбор.Найти(РодительВида) = Неопределено Тогда 
					МассивВидовОтбор.Добавить(РодительВида);
				КонецЕсли;	
				РодительВида = РодительВида.Родитель;
			КонецЦикла;
		КонецЦикла;
		
		ЗапросВидов.УстановитьПараметр("ПарамВиды", МассивВидовОтбор);
	КонецЕсли;
	
	ЗапросВидов.Текст = ЗапросВидов.Текст + "
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	aps_ВидыЭлементов.Код ИЕРАРХИЯ";
	ЗапросВидов.УстановитьПараметр("ИндексКартинкиПапки", 2);
	Дерево = ЗапросВидов.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дерево.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	
КонецПроцедуры

// Получает дерево свойств для данного вида элемента
//
// Параметры:
//		ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов;
//		Дерево - ДеревоЗначений
//
// Пример:
//      ДеревоСвойствРесурса = Новый ДеревоЗначений;
//		МодульСозданияОбъектов.aps_ОбновитьДеревоСвойств(Справочники.aps_ВидыЭлементов.Ресурс, ДеревоСвойствРесурса);
//
Процедура aps_ОбновитьДеревоСвойств( ВидЭлемента, Дерево, ШаблонТехСвязи = Неопределено, ЗаполнитьЗначенияПоУмолчанию = Истина ) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	aps_СвойстваЭлементов.Наименование КАК Имя,
	                      |	aps_СвойстваЭлементов.Ссылка КАК СвойствоЭлемента,
	                      |	aps_СвойстваЭлементов.СвойствоЭлемента КАК Свойство,
	                      |	aps_СвойстваЭлементов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	aps_СвойстваЭлементов.ЭтоГруппа КАК ЭтоГруппа,
	                      |	ВЫБОР
	                      |		КОГДА aps_СвойстваЭлементов.ЭтоГруппа
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК Картинка
	                      |ИЗ
	                      |	Справочник.aps_СвойстваЭлементов КАК aps_СвойстваЭлементов
	                      |ГДЕ
	                      |	(НЕ aps_СвойстваЭлементов.ПометкаУдаления)
	                      |	И (aps_СвойстваЭлементов.Владелец = &ПарамВидЭлемента
	                      |			ИЛИ aps_СвойстваЭлементов.Владелец = &ПарамВидСвязи)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЭтоГруппа ИЕРАРХИЯ,
	                      |	aps_СвойстваЭлементов.Код,
	                      |	Имя");
	Запрос.УстановитьПараметр("ПарамВидЭлемента", ВидЭлемента);
	Запрос.УстановитьПараметр("ПарамВидСвязи"	, ШаблонТехСвязи);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дерево.Колонки.Добавить("Значение");
	
	Если ЗаполнитьЗначенияПоУмолчанию Тогда // заполнить значения свойств по умолчанию
		aps_ЗаполнениеЗначенийДереваСвойствРек( Дерево.Строки );
	КонецЕсли;
КонецПроцедуры

// Заполняет значения параметров в дереве
//
// Параметры
//		Строки - КоллекцияСтрокДереваЗначений, строки дерева свойств
Процедура aps_ЗаполнениеЗначенийДереваСвойствРек( Строки )
	Для Каждого Строка Из Строки Цикл
		Если ЗначениеЗаполнено(Строка.СвойствоЭлемента) И НЕ Строка.СвойствоЭлемента.ЭтоГруппа Тогда
			Если Строка.СвойствоЭлемента.СпособЗаполнения = 0 Тогда
				Строка.Значение = Строка.Свойство.ТипЗначения.ПривестиЗначение(Строка.СвойствоЭлемента.ЗначениеПоУмолч);
			ИначеЕсли Строка.СвойствоЭлемента.СпособЗаполнения = 1 Тогда // владелец
				Строка.Значение = ПараметрыСеанса.ТекущийПользователь;
			ИначеЕсли Строка.СвойствоЭлемента.СпособЗаполнения = 2 Тогда // дата
				Строка.Значение = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		aps_ЗаполнениеЗначенийДереваСвойствРек( Строка.Строки );
	КонецЦикла;
КонецПроцедуры

// Создает параметры по дереву свойств
//
// Параметры:
//		Строки - КоллекцияСтрокДереваЗначений, строки дерева свойств
//		ЭлементОбъект - СправочникОбъект.aps_ЭлементыИзделия, aps_ЭлементыТехнологии, aps_ЭлементыСправочников
//		Группа - СправочникСсылка.aps_ПараметрыЭлементовИзделия, СправочникСсылка.aps_ПараметрыЭлементовТехнологии
// Пример:
//		aps_СозданиеПараметровПоДереву( Строка.Строки, ЭлементОбъект, ГруппаПараметров );
//
Процедура aps_СозданиеПараметровПоДереву( Строки, ЭлементОбъект, Группа = Неопределено ) Экспорт 
	
	Для Каждого Строка Из Строки Цикл
		
		Имя					= Строка.Имя;
		СвойствоЭлемента	= Строка.СвойствоЭлемента;
		Свойство			= Строка.Свойство;
		ЕдиницаИзмерения	= Строка.ЕдиницаИзмерения;
		ЗначениеСвойства	= Строка.Значение;
		ЭтоГруппа 			= Строка.ЭтоГруппа;
		
		Если ЭтоГруппа = Истина Тогда
			ГруппаПараметров = МодульСозданияПараметров.aps_СозданиеПараметра( ЭлементОбъект, Имя,,, Истина, Группа );
			aps_СозданиеПараметровПоДереву( Строка.Строки, ЭлементОбъект, ГруппаПараметров );
			
		ИначеЕсли ЗначениеЗаполнено(Свойство) Тогда
			
			Если НЕ НеЗаписыватьВБД И ЗначениеЗаполнено(СвойствоЭлемента) Тогда 
				Если СвойствоЭлемента.ПустоеНедопустимо И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					ВызватьИсключение НСтр("ru = ""Незаполненное свойство <""; en_US = ""The <""")+ СвойствоЭлемента.Наименование + НСтр("ru = ""> недопустимо!""; en_US = ""> property must be filled!""");
				ИначеЕсли СвойствоЭлемента.ИгнорироватьБезЗначения И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					Продолжить; // не создавать параметр
				КонецЕсли;
			КонецЕсли;
			
			МодульСозданияПараметров.aps_СозданиеПараметра( ЭлементОбъект, Имя, Свойство, ЗначениеСвойства, Ложь, Группа, ЕдиницаИзмерения );
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает xdto-параметры по дереву свойств
//
// Параметры:
//		Строки - КоллекцияСтрокДереваЗначений, строки дерева свойств
//		ОбъектМоделиXDTO - xdto-модель
//		ПринадлежатСвязи - Булево, отличительный признак параметров связи
//		СправочникПараметров - менеджер справочника параметров
// Пример:
//		aps_СозданиеПараметровXDTOПоДереву( Строка.Строки, НовыйПараметрXDTO, ПринадлежатСвязи, СправочникПараметров );
//
Процедура aps_СозданиеПараметровXDTOПоДереву( Строки, ОбъектМоделиXDTO, ПринадлежатСвязи = Ложь, СправочникПараметров = Неопределено ) Экспорт 
	
	Если СправочникПараметров = Неопределено Тогда 
		Если ПринадлежатСвязи Тогда 
			ВидЭлемента = ?(ОбъектМоделиXDTO.linkType=Перечисления.aps_ВидыСвязей.СоставИзделия, Справочники.aps_ВидыЭлементов.СвязьСостава, Справочники.aps_ВидыЭлементов.СвязьТехнологии);
		Иначе 
			ВидЭлемента = ОбъектМоделиXDTO.elementType;
		КонецЕсли;
		СправочникПараметров = МодульСозданияПараметров.aps_ПолучитьСправочникПараметров(ВидЭлемента);
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		
		Имя					= Строка.Имя;
		СвойствоЭлемента	= Строка.СвойствоЭлемента;
		Свойство			= ?(ЗначениеЗаполнено(Строка.Свойство), Строка.Свойство, Неопределено);
		ЕдиницаИзмерения	= Строка.ЕдиницаИзмерения;
		ЗначениеСвойства	= Строка.Значение;
		ЭтоГруппа 			= Строка.ЭтоГруппа;
		
		Попытка
			Ссылка = Строка.Ссылка;
		Исключение
			Ссылка = Неопределено;
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда 
			Ссылка = СправочникПараметров.ПолучитьСсылку();
		КонецЕсли;
		
		Если ЭтоГруппа = Истина И Строка.Строки.Количество() > 0 Тогда // создать группу параметров
			
			НовыйПараметрXDTO = aps_НайтиВМассивеXDTO(ОбъектМоделиXDTO.parameters, Новый Структура("description", Имя));
			Если НовыйПараметрXDTO = Неопределено Тогда 
				НовыйПараметрXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "parameter"));
				НовыйПараметрXDTO.reference		= СериализаторXDTO.ЗаписатьXDTO(Ссылка);
				НовыйПараметрXDTO.description	= Имя;
				НовыйПараметрXDTO.linkParameter	= ПринадлежатСвязи;
				
				ОбъектМоделиXDTO.parameters.Добавить(НовыйПараметрXDTO);
			КонецЕсли;
			
			aps_СозданиеПараметровXDTOПоДереву( Строка.Строки, НовыйПараметрXDTO, ПринадлежатСвязи, СправочникПараметров );
			
		ИначеЕсли ЗначениеЗаполнено(Свойство) Тогда
			
			Если НЕ НеЗаписыватьВБД И ЗначениеЗаполнено(СвойствоЭлемента) Тогда 
				Если СвойствоЭлемента.ПустоеНедопустимо И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					ВызватьИсключение НСтр("ru = ""Незаполненное свойство <""; en_US = ""The <""")+ СвойствоЭлемента.Наименование + НСтр("ru = ""> недопустимо!""; en_US = ""> property must be filled!""");
				ИначеЕсли СвойствоЭлемента.ИгнорироватьБезЗначения И НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					Продолжить; // не создавать параметр
				КонецЕсли;
			КонецЕсли;
			
			НовыйПараметрXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "parameter"));
			НовыйПараметрXDTO.reference		= СериализаторXDTO.ЗаписатьXDTO(Ссылка);
			НовыйПараметрXDTO.description	= Имя;
			НовыйПараметрXDTO.property		= Свойство;
			НовыйПараметрXDTO.value			= ?(ЗначениеЗаполнено(ЗначениеСвойства), СериализаторXDTO.ЗаписатьXDTO(ЗначениеСвойства), Неопределено);
			НовыйПараметрXDTO.unit			= ЕдиницаИзмерения;
			НовыйПараметрXDTO.linkParameter	= ПринадлежатСвязи;
			
			ОбъектМоделиXDTO.parameters.Добавить(НовыйПараметрXDTO);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция добавляет свойство в дерево свойств
//
// Параметры
//			СвойствоЭлемента - СправочникСсылка.aps_СвойстваЭлементов, ПланВидовХарактеристикСсылка.aps_Свойства
//			Значение - значение свойства
//			Имя - имя параметра
//			ЕдиницаИзмерения - единица измерения параметра
//			СуществующееДерево - ДеревоЗначений
// Возвращаемое значение:
//			ДеревоЗначений, дерево свойств
// Пример:
//			созданиеОбъектов.aps_НеинтерактивноеДобавлениеСвойстваВДерево(СтрокаТаблицы.Свойство, СтрокаТаблицы.Значение, СтрокаТаблицы.Имя,, ДеревоСвойств);
//
Функция aps_НеинтерактивноеДобавлениеСвойстваВДерево( СвойствоЭлемента, Значение, Имя = Неопределено, ЕдиницаИзмерения = Неопределено, СуществующееДерево = Неопределено ) Экспорт
	Если СуществующееДерево = Неопределено Тогда
			СуществующееДерево = Новый ДеревоЗначений();
			СуществующееДерево.Колонки.Добавить("Имя");
			СуществующееДерево.Колонки.Добавить("ЭтоГруппа");
			СуществующееДерево.Колонки.Добавить("СвойствоЭлемента");
			СуществующееДерево.Колонки.Добавить("Свойство");
			СуществующееДерево.Колонки.Добавить("ЕдиницаИзмерения");
			СуществующееДерево.Колонки.Добавить("Значение");
	КонецЕсли;
		
	СтрокаДерева = СуществующееДерево.Строки.Добавить();
	Если ТипЗнч(СвойствоЭлемента) = Тип("СправочникСсылка.aps_СвойстваЭлементов") Тогда
		СтрокаДерева.Свойство		  = СвойствоЭлемента.СвойствоЭлемента;
		СтрокаДерева.СвойствоЭлемента = СвойствоЭлемента;
	Иначе
		СтрокаДерева.Свойство = СвойствоЭлемента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено( Имя ) Тогда 
		СтрокаДерева.Имя = Имя;
	Иначе 
		СтрокаДерева.Имя = СвойствоЭлемента.Наименование;
	КонецЕсли;
	
	СтрокаДерева.Значение		  = Значение;
	СтрокаДерева.ЕдиницаИзмерения = ЕдиницаИзмерения;
	
	Возврат СуществующееДерево;
КонецФункции

// Функция создает новый объект PDM с заданными свойствами 
//
// Параметры
//			ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов
//			ДеревоСвойств - ДеревоЗначенийСвойств
//			СсылкаНового - Ссылка, которая будет назначена при записи нового объекта PDM
// Возвращаемое значение:
//			СправочникОбъект.aps_ЭлементыИзделия, aps_ЭлементыТехнологии, aps_ЭлементыСправочников
// Пример:
//		    НовыйЭлементСтруктуры=созданиеОбъектов.aps_СозданиеОбъектаPDM(ВидСоздаваемогоИзделия, ДеревоСвойств, СуществующийЭлемент);
//
Функция aps_СозданиеОбъектаPDM( ВидЭлемента, ДеревоСвойств, СсылкаНового = Неопределено,
    УправлениеТранзакциейСнаружи = Ложь) Экспорт;

    Если ВидЭлемента = Неопределено Или ДеревоСвойств = Неопределено Тогда
        ВызватьИсключение "aps_СозданиеОбъектаPDM: " + НСтр("ru = ""Неверно заданы входные параметры!""; en_US = ""Input parameters are incorrectly specified!""");
    КонецЕсли;

    Если НЕ УправлениеТранзакциейСнаружи Тогда
        НачатьТранзакцию();
    КонецЕсли;

    Попытка

        Если ЗначениеЗаполнено(СсылкаНового) Тогда
            СправочникЭлементов = Справочники[СсылкаНового.Метаданные().Имя];
        Иначе
            СправочникЭлементов = aps_ПолучитьСправочникЭлементов(ВидЭлемента);
        КонецЕсли;

        ОбъектPDMСистемы = СправочникЭлементов.СоздатьЭлемент();
        ОбъектPDMСистемы.UID = ПараметрыСеанса.ТекущийПользователь;
        ОбъектPDMСистемы.GID = Перечисления.aps_СистемныеГруппы.Пользователи;

        ОбъектPDMСистемы.ВидЭлемента = ВидЭлемента;
        ОбъектPDMСистемы.ИндексКартинки = ВидЭлемента.ИндексКартинки;

        Если ЗначениеЗаполнено(СсылкаНового) Тогда
            ОбъектPDMСистемы.УстановитьСсылкуНового(СсылкаНового);
        КонецЕсли;

        Если НЕ НеЗаписыватьВБД Тогда
            #Если Клиент Или ВнешнееСоединение Тогда
                // гл. переменная
            #Иначе
                aps_СтруктураПараметровОповещения = aps_СтруктураПараметровОповещенияНаСервере;
            #КонецЕсли

            aps_СтруктураПараметровОповещения.Вставить("itemObject", ОбъектPDMСистемы);
            aps_ОбработчикиСобытий.aps_ВыполнитьСобытие(
                Перечисления.aps_События.ПриСозданииЭлемента,
                aps_СтруктураПараметровОповещения);
        КонецЕсли;

        МодульСозданияПараметров.НеЗаписыватьВБД = НеЗаписыватьВБД;
        aps_СозданиеПараметровПоДереву(
            ДеревоСвойств.Строки,
            ОбъектPDMСистемы);

        Если ОбъектPDMСистемы.Параметры.Количество() > 0 Тогда
            aps_СоздатьПредставление(ОбъектPDMСистемы);
        КонецЕсли;

        Попытка
            ОбъектPDMСистемы.Записать();
        Исключение
            // Вернуть ссылку на существующий элемент.
            ОбъектPDMСистемы.ДополнительныеСвойства.Свойство(
                "СуществующийЭлемент",
                СсылкаНового);
            ВызватьИсключение;
        КонецПопытки;

        Если НеЗаписыватьВБД Тогда
            ОбъектМоделиXDTO = aps_СоздатьОбъектМоделиXDTO(
                ОбъектPDMСистемы.Ссылка);

            aps_ЗаполнитьПредставлениеМоделиПоТабЧасти(
                ОбъектМоделиXDTO,
                ОбъектPDMСистемы.ПредставлениеЭлемента);

            ОбъектPDMСистемы = ОбъектМоделиXDTO;

            Если НЕ УправлениеТранзакциейСнаружи Тогда
                ОтменитьТранзакцию();
            КонецЕсли;
        Иначе
            Если НЕ УправлениеТранзакциейСнаружи Тогда
                ЗафиксироватьТранзакцию();
            КонецЕсли;
        КонецЕсли;

        Возврат ОбъектPDMСистемы;

    Исключение

        Если НЕ УправлениеТранзакциейСнаружи Тогда
            ОтменитьТранзакцию();
        КонецЕсли;

        ВызватьИсключение;

    КонецПопытки;

КонецФункции


// Функция создает позицию номенклатуры для указанного элемента
//
// Параметры
//			СтруктураЗначенийРеквизитов - Структура, значения реквизитов справочника номенклатуры
//			item (необязательный) - СправочникСсылка.aps_ЭлементыИзделия, СправочникСсылка.aps_ЭлементыТехнологии,
//									СправочникСсылка.aps_ЭлементыСправочников
// Возвращаемое значение:
// 			СправочникСсылка.Номенклатура
//
// Пример:
//			ЭлементНоменклатуры=МодульСозданияОбъектов.aps_СозданиеПозицииНоменклатуры(СтруктураПолейНоменклатуры, item, Ложь);
//
Функция aps_СозданиеПозицииНоменклатуры( СтруктураЗначенийРеквизитов, item = Неопределено, СвязатьСНоменклатурой = Истина ) Экспорт
	
	Если СтруктураЗначенийРеквизитов = Неопределено Тогда
		ВызватьИсключение "aps_СозданиеПозицииНоменклатуры: " + НСтр("ru = ""Неверно заданы входные параметры!""; en_US = ""Input parameters are incorrectly specified!""");
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
			НовыйЭлементНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
			
			Для Каждого Реквизит Из НовыйЭлементНоменклатуры.Метаданные().СтандартныеРеквизиты Цикл 
				Если СтруктураЗначенийРеквизитов.Свойство(Реквизит.Имя) Тогда 
					НовыйЭлементНоменклатуры[Реквизит.Имя]=СтруктураЗначенийРеквизитов[Реквизит.Имя];
				КонецЕсли;
			КонецЦикла;
			Для Каждого Реквизит Из НовыйЭлементНоменклатуры.Метаданные().Реквизиты Цикл 
				Если СтруктураЗначенийРеквизитов.Свойство(Реквизит.Имя) Тогда 
					НовыйЭлементНоменклатуры[Реквизит.Имя]=СтруктураЗначенийРеквизитов[Реквизит.Имя];
				КонецЕсли;
			КонецЦикла;
			
			#Если Клиент Или ВнешнееСоединение Тогда 
				// гл. переменная
			#Иначе
				aps_СтруктураПараметровОповещения=aps_СтруктураПараметровОповещенияНаСервере;
			#КонецЕсли
			
			aps_СтруктураПараметровОповещения.Вставить("item",item);
			aps_СтруктураПараметровОповещения.Вставить("itemObject",НовыйЭлементНоменклатуры);
			// обработчик события "ПриСозданииНоменклатуры"
			aps_ОбработчикиСобытий.aps_ВыполнитьСобытие(Перечисления.aps_События.ПриСозданииНоменклатуры, aps_СтруктураПараметровОповещения);
			
			НовыйЭлементНоменклатуры.Записать();
			
			aps_ОбработчикиСобытий.aps_ВыполнитьСобытие(Перечисления.aps_События.ПослеСозданияНоменклатуры, aps_СтруктураПараметровОповещения);
			
			Если ЗначениеЗаполнено( item ) И СвязатьСНоменклатурой Тогда 
				itemObject = item.ПолучитьОбъект();
				МодульСозданияПараметров.aps_УстановкаПараметра(itemObject, ПланыВидовХарактеристик.aps_Свойства.Номенклатура, НовыйЭлементНоменклатуры.Ссылка);
				Если itemObject.Модифицированность() Тогда 
					itemObject.Записать();
				КонецЕсли;
			КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		
		Возврат НовыйЭлементНоменклатуры.Ссылка;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецФункции

// Функция определяет системный справочник по виду элемента
//
// Параметры
//			ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов
// Возвращаемое значение: 
//			СправочникМенеджер. Имя справочника хранения элемента
// Пример:
//			СправочникСвязей = МодульСозданияОбъектов.aps_ПолучитьСправочникЭлементов(Справочники.aps_ВидыЭлементов.СвязьСостава);
//
Функция aps_ПолучитьСправочникЭлементов( ВидЭлемента ) Экспорт
	
	Если ВидЭлемента = Справочники.aps_ВидыЭлементов.Деталь						ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.Комплекс					ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.Комплект					ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.ЭлектроРадиоЭлемент		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.СбЕдиница					ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.ПакетЗамены				ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.ВариантЗамены				ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.Документ					ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежSolidWorks	ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальSolidWorks	ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаSolidWorks	ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежКОМПАС		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальКОМПАС		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаКОМПАС		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежAutoCAD		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальAutoCAD		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаAutoCAD		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежInventor		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальInventor		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаInventor		ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежSolidEdge	ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальSolidEdge	ИЛИ
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаSolidEdge	ИЛИ
		 
		 ВидЭлемента = Справочники.aps_ВидыЭлементов.Оформление	Тогда 
			
		Возврат Справочники.aps_ЭлементыИзделия;
		
	ИначеЕсли ВидЭлемента = Справочники.aps_ВидыЭлементов.ЛичнаяПапка			ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.ПапкаСправочника		ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.Ресурс				ИЛИ 
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.Материал				ИЛИ 
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.ПрИзд					ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.СтИзд					ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.ЗаписьТаблицы			ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.Оборудование			ИЛИ	
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.СредствоТехнологическогоОснащения
			  ИЛИ ВидЭлемента = Справочники.aps_ВидыЭлементов.ВидТехнологическойОперации Тогда 
					
		Возврат Справочники.aps_ЭлементыСправочников;
		
	ИначеЕсли ВидЭлемента = Справочники.aps_ВидыЭлементов.СвязьСостава ИЛИ
			  ВидЭлемента = Справочники.aps_ВидыЭлементов.СвязьТехнологии Тогда 
					
		Возврат Справочники.aps_ЭлементыСвязей;
		
	Иначе
		
		Возврат Справочники.aps_ЭлементыТехнологии;
		
	КонецЕсли;
	
КонецФункции

// Процедура создает представление по умолчанию по виду элемента
//
// Параметры
//		ЭлементОбъект - СправочникОбъект.aps_ЭлементыИзделия, aps_ЭлементыТехнологии, aps_ЭлементыСправочников
//
Процедура aps_СоздатьПредставление( ЭлементОбъект ) Экспорт
	ЭлементОбъект.ПредставлениеЭлемента.Очистить();
	
	Для Каждого СтрокаПредставленияВида Из ЭлементОбъект.ВидЭлемента.ПредставлениеЭлемента Цикл
		Если ТипЗнч(СтрокаПредставленияВида.Свойство) = Тип("ПланВидовХарактеристикСсылка.aps_Свойства") Тогда 
			Параметр = МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойству( ЭлементОбъект, СтрокаПредставленияВида.Свойство );
			
			Если ЗначениеЗаполнено(Параметр) Тогда
				ЭлементОбъект.ПредставлениеЭлемента.Добавить().Параметр = Параметр;
			КонецЕсли;
		Иначе // Строка ( Здесь в  СтрокаПредставленияВида.Свойство передается текстовая строка !!!)
			ЭлементОбъект.ПредставлениеЭлемента.Добавить().Параметр = СтрокаПредставленияВида.Свойство;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция создает новую связь PDM с заданными свойствами 
//
// Параметры
//			ВидЭлемента - СправочникСсылка.aps_ВидыЭлементов, вид элементной связи
//			РодительСсылка - СправочникСсылка.aps_ЭлементыИзделия, СправочникСсылка.aps_ЭлементыТехнологии,
//							 СправочникСсылка.aps_ЭлементыСправочников
//			ПотомокСсылка - СправочникСсылка.aps_ЭлементыИзделия, СправочникСсылка.aps_ЭлементыТехнологии,
//							СправочникСсылка.aps_ЭлементыСправочников
//			ПарамВидСвязи - ПеречислениеСсылка.aps_ВидыСвязей
//			ДеревоСвойств - ДеревоЗначенийСвойств
// Возвращаемое значение:
//			СправочникОбъект.aps_ЭлементыСвязей
// Пример:
//			ОбъектСвязи=МодульСозданияОбъектов.aps_СозданиеЭлементнойСвязи(ВидЭлементаСвязи, РодительСсылка, itemXDTO.element, itemXDTO.linkType, Новый ДеревоЗначений(), itemXDTO.link);
//
Функция aps_СозданиеЭлементнойСвязи( ВидЭлемента, РодительСсылка, ПотомокСсылка, ПарамВидСвязи, ДеревоСвойств, СсылкаНового = Неопределено ) Экспорт
	
	Если ВидЭлемента = Неопределено Или РодительСсылка = Неопределено Или ПотомокСсылка = Неопределено Или ПарамВидСвязи = Неопределено Или ДеревоСвойств = Неопределено Тогда
		ВызватьИсключение "aps_СозданиеЭлементнойСвязи: " + НСтр("ru = ""Неверно заданы входные параметры!""; en_US = ""Input parameters are incorrectly specified!""");
	КонецЕсли;
	
	Попытка 
		
		НачатьТранзакцию();
		
			ОбъектPDMСистемы = Справочники.aps_ЭлементыСвязей.СоздатьЭлемент();
			
			ОбъектPDMСистемы.UID = ПараметрыСеанса.ТекущийПользователь;
			ОбъектPDMСистемы.GID = Перечисления.aps_СистемныеГруппы.Пользователи;
			
			ОбъектPDMСистемы.ВидЭлемента = ВидЭлемента;
			
			ОбъектPDMСистемы.РодительСсылка	= РодительСсылка;
			ОбъектPDMСистемы.ПотомокСсылка	= ПотомокСсылка;
			ОбъектPDMСистемы.ВидСвязи		= ПарамВидСвязи;
			
			Если ЗначениеЗаполнено(СсылкаНового) Тогда 
				ОбъектPDMСистемы.УстановитьСсылкуНового( СсылкаНового );
			КонецЕсли;
			
			#Если Клиент Или ВнешнееСоединение Тогда 
				// гл. переменная
			#Иначе
				aps_СтруктураПараметровОповещения=aps_СтруктураПараметровОповещенияНаСервере;
			#КонецЕсли
			
			aps_СтруктураПараметровОповещения.Вставить("itemObject",ОбъектPDMСистемы);
			aps_ОбработчикиСобытий.aps_ВыполнитьСобытие(Перечисления.aps_События.ПриСозданииСвязи, aps_СтруктураПараметровОповещения);
			
			aps_СозданиеПараметровПоДереву( ДеревоСвойств.Строки, ОбъектPDMСистемы );
			
			ОбъектPDMСистемы.Записать();
			
		ЗафиксироватьТранзакцию();
		
		Возврат ОбъектPDMСистемы;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
КонецФункции

// Функция создает новую вертикальную связь PDM данного вида
//
// Параметры
//		РодительСсылка	- СправочникСсылка.aps_ЭлементыИзделия, СправочникСсылка.aps_ЭлементыТехнологии,
//						  СправочникСсылка.aps_ЭлементыСправочников
//		ПотомокСсылка	- СправочникСсылка.aps_ЭлементыИзделия, СправочникСсылка.aps_ЭлементыТехнологии, 
//						  СправочникСсылка.aps_ЭлементыСправочников
//		ПарамВидСвязи	- ПеречислениеСсылка.aps_ВидыСвязей
// Возвращаемое значение:
//		СправочникОбъект.aps_ВертикальныеСвязи
// Пример:
//		ОбъектСвязи=МодульСозданияОбъектов.aps_СозданиеВертикальнойСвязи(parentItem, itemXDTO.element, itemXDTO.linkType, itemXDTO.link);
//
Функция aps_СозданиеВертикальнойСвязи( РодительСсылка, ПотомокСсылка, ПарамВидСвязи, СсылкаНового = Неопределено ) Экспорт
	
	Если РодительСсылка = Неопределено Или ПотомокСсылка = Неопределено Или ПарамВидСвязи = Неопределено Тогда
		ВызватьИсключение "aps_СозданиеВертикальнойСвязи: " + НСтр("ru = ""Неверно заданы входные параметры!""; en_US = ""Input parameters are incorrectly specified!""");
	КонецЕсли;
	
	Попытка 
		
		НачатьТранзакцию();
		
			ОбъектPDMСистемы = Справочники.aps_ВертикальныеСвязи.СоздатьЭлемент();
			
			ОбъектPDMСистемы.РодительСсылка	= РодительСсылка;
			ОбъектPDMСистемы.ПотомокСсылка	= ПотомокСсылка;
			ОбъектPDMСистемы.ВидСвязи		= ПарамВидСвязи;
			
			Если ЗначениеЗаполнено(СсылкаНового) Тогда 
				ОбъектPDMСистемы.УстановитьСсылкуНового( СсылкаНового );
			КонецЕсли;
			
			ОбъектPDMСистемы.Записать();
			
			
		ЗафиксироватьТранзакцию();
		
		Возврат ОбъектPDMСистемы;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
КонецФункции

// Функция находит или создает в случае отсутствия личную папку пользователя
//
// Параметры
//  ПользовательСсылка - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  СправочникСсылка.aps_ЭлементыСправочников
//
Функция aps_НайтиИлиСоздатьПапкуПользователя( ПользовательСсылка = Неопределено ) Экспорт 
	Если ПользовательСсылка = Неопределено Тогда
		ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	aps_ЭлементыСправочников.Ссылка
						  |ИЗ
						  |	Справочник.aps_ЭлементыСправочников КАК aps_ЭлементыСправочников
						  |ГДЕ
						  |	aps_ЭлементыСправочников.ВидЭлемента = &ПарамВид
						  |	И aps_ЭлементыСправочников.UID = &ПарамВладелец
						  |	И (НЕ aps_ЭлементыСправочников.ПометкаУдаления)");
	Запрос.УстановитьПараметр("ПарамВид"		, Справочники.aps_ВидыЭлементов.ЛичнаяПапка);
	Запрос.УстановитьПараметр("ПарамВладелец"	, ПользовательСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
			СозданиеОбъектов = Обработки.aps_СозданиеОбъектов.Создать();
			
			ДеревоСвойствПапки = Новый ДеревоЗначений;
			СозданиеОбъектов.aps_ОбновитьДеревоСвойств(Справочники.aps_ВидыЭлементов.ЛичнаяПапка, ДеревоСвойствПапки);
			
			НаименованиеПапки = ПользовательСсылка.Наименование;
			
			СтрокаСвойства = ДеревоСвойствПапки.Строки.Найти(ПланыВидовХарактеристик.aps_Свойства.Наименование, "Свойство", Истина);
			Если СтрокаСвойства <> Неопределено Тогда 
				СтрокаСвойства.Значение = НаименованиеПапки;
			Иначе // Добавить свойство "Наименование" в дерево в случае отсутствия
				СозданиеОбъектов.aps_НеинтерактивноеДобавлениеСвойстваВДерево(ПланыВидовХарактеристик.aps_Свойства.Наименование, НаименованиеПапки,,, ДеревоСвойствПапки);
			КонецЕсли;
			
			ОбъектПапки = СозданиеОбъектов.aps_СозданиеОбъектаPDM( Справочники.aps_ВидыЭлементов.ЛичнаяПапка, ДеревоСвойствПапки );
			
		ЗафиксироватьТранзакцию();
		
		Возврат ОбъектПапки.Ссылка;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецФункции

#КонецЕсли

#КонецОбласти


#Область Инициализация

#Если Не МобильноеПриложениеСервер Тогда
	
// Инициализация таблицы значений
СозданныеЭлементы = Новый ТаблицаЗначений();
СозданныеЭлементы.Колонки.Добавить("СозданныйЭлемент");

#КонецЕсли

#Если Сервер Тогда 
aps_СтруктураПараметровОповещенияНаСервере=Новый Структура();
#КонецЕсли

#КонецОбласти
