// ----------------------------------------------
// Система управления инженерными данными 1С:PDM
// -----------------------------------------------
// Разработка компании Appius, www.appius.ru
// -----------------------------------------------

#Если НЕ МобильноеПриложениеСервер И (ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Или Сервер Или ВнешнееСоединение) Тогда 
	
#Область ЭкспортныеФункции

// Функция создает объект XDTO типа "item" для элемента
// Параметры:
//		item - ссылка на элемент
//		ИсточникДанных - СтрокаТаблицыЗначений, строка результата итератора
// Возвращаемое значение:
//		ОбъектXDTO, объект модели XDTO
// Пример:
// 		itemXDTO = aps_СоздатьОбъектМоделиXDTO(ЭлементДерева.ЭлементСсылка, ИсточникДанных);
Функция aps_СоздатьОбъектМоделиXDTO( item, ИсточникДанных = Неопределено, ВключаяПараметры = Истина ) Экспорт 
	
	itemXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "item"));
	
	itemXDTO.refLinkGroup = ТипЗнч(item)=Тип("СправочникСсылка.aps_ШаблоныТехнологическихСвязей");
	
	Если ИсточникДанных <> Неопределено Тогда 
		
		Если itemXDTO.refLinkGroup Тогда 
			itemXDTO.pictureIndex	= ИсточникДанных.КартинкаСвязи;
			itemXDTO.linkType		= СериализаторXDTO.ЗаписатьXDTO(item.Ссылка);
			itemXDTO.description	= ИсточникДанных.ПредставлениеСвязи;
		Иначе 
			itemXDTO.element		= СериализаторXDTO.ЗаписатьXDTO(item.Ссылка);
			itemXDTO.elementType	= ИсточникДанных.ВидЭлемента;
			itemXDTO.pictureIndex	= ИсточникДанных.Картинка;
			itemXDTO.description	= ИсточникДанных.ПредставлениеЭлемента;
			itemXDTO.htmlContent	= ИсточникДанных.HTMLКонтент;
			itemXDTO.UID			= ?(ЗначениеЗаполнено(ИсточникДанных.Владелец), СериализаторXDTO.ЗаписатьXDTO(ИсточникДанных.Владелец), Неопределено);
			itemXDTO.GID			= ?(ЗначениеЗаполнено(ИсточникДанных.Группа), СериализаторXDTO.ЗаписатьXDTO(ИсточникДанных.Группа), Неопределено);
			
			Если ВключаяПараметры Тогда 
				// выбрать таблицу параметров элемента
				Если ТипЗнч(ИсточникДанных.ЭлементСсылка)=Тип("СправочникСсылка.aps_ЭлементыИзделия") Тогда 
					Параметры = ИсточникДанных.ПараметрыЭлементаИзделия;
				ИначеЕсли ТипЗнч(ИсточникДанных.ЭлементСсылка)=Тип("СправочникСсылка.aps_ЭлементыСправочников") Тогда 
					Параметры = ИсточникДанных.ПараметрыЭлементаСправочника;
				ИначеЕсли ТипЗнч(ИсточникДанных.ЭлементСсылка)=Тип("СправочникСсылка.aps_ЭлементыТехнологии") Тогда 
					Параметры = ИсточникДанных.ПараметрыЭлементаТехнологии;
				КонецЕсли;
				
				aps_ЗаполнитьПараметрыМоделиПоТаблице(itemXDTO, Параметры);
			КонецЕсли;
		КонецЕсли;
		
	Иначе 
		
		Если itemXDTO.refLinkGroup Тогда 
			itemXDTO.pictureIndex	= item.ИндексКартинки;
			itemXDTO.linkType		= СериализаторXDTO.ЗаписатьXDTO(item);
			itemXDTO.description	= item.Наименование;
		Иначе 
			itemXDTO.element		= СериализаторXDTO.ЗаписатьXDTO(item);
			itemXDTO.elementType	= item.ВидЭлемента;
			itemXDTO.pictureIndex	= ?(item.ИндексКартинки=0, item.ВидЭлемента.ИндексКартинки, item.ИндексКартинки);
			itemXDTO.description	= item.Наименование;
			itemXDTO.htmlContent	= item.HTMLКонтент;
			itemXDTO.UID			= ?(ЗначениеЗаполнено(item.UID), СериализаторXDTO.ЗаписатьXDTO(item.UID), Неопределено);
			itemXDTO.GID			= ?(ЗначениеЗаполнено(item.GID), СериализаторXDTO.ЗаписатьXDTO(item.GID), Неопределено);
			
			Если ВключаяПараметры Тогда 
				aps_ЗаполнитьПараметрыМоделиПоТабЧасти(itemXDTO, item.Параметры);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Возврат itemXDTO;
	
КонецФункции

// Функция создает новый объект модели XDTO копированием существующего
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
// Возвращаемое значение:
//		ОбъектXDTO, копия
// Пример:
// 		itemXDTO = aps_СкопироватьОбъектМоделиXDTO(МассивПеретаскивания[i]);
Функция aps_СкопироватьОбъектМоделиXDTO( itemXDTO ) Экспорт 
	Возврат Строка2XDTO(XDTO2Строка(itemXDTO));
КонецФункции

// Функция создает новый объект модели XDTO копированием существующего для последующего редактирования и сохранения
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
// Возвращаемое значение:
//		ОбъектXDTO, копия
// Пример:
//		itemXDTO = aps_СкопироватьОбъектМоделиXDTOДляСохранения(МассивПеретаскивания[i]);
Функция aps_СкопироватьОбъектМоделиXDTOДляСохранения( Знач itemXDTO, возвСоответствиеСсылок = Неопределено ) Экспорт
	Если возвСоответствиеСсылок = Неопределено Тогда 
		возвСоответствиеСсылок = Новый Соответствие();
	КонецЕсли;
	
	МодульСозданияОбъектов=Обработки.aps_СозданиеОбъектов.Создать();
	МодульСозданияПараметров=Обработки.aps_СозданиеПараметров.Создать();
	
	МассивXDTO=Новый Массив();
	МассивXDTO.Добавить(aps_СкопироватьОбъектМоделиXDTO(itemXDTO));
	Для Каждого itemXDTO Из МассивXDTO Цикл 
		МассивПараметровXDTO=aps_СформироватьМассивПараметровИзМоделиXDTO(itemXDTO);
		
		Если itemXDTO.Владелец()=Неопределено 
				ИЛИ (ТипЗнч(itemXDTO.linkType)=Тип("СправочникСсылка.aps_ШаблоныТехнологическихСвязей") И itemXDTO.linkType.ГоризонтальнаяСвязь=Ложь) Тогда 
			// создать копию элемента в чек-ауте
			Если itemXDTO.presentation.Количество()=0 Тогда 
				aps_ЗаполнитьПредставлениеМоделиПоТабЧасти(itemXDTO, itemXDTO.element.ПредставлениеЭлемента);
			КонецЕсли;
			
			СсылкаНового=МодульСозданияОбъектов.aps_ПолучитьСправочникЭлементов(itemXDTO.elementType).ПолучитьСсылку();
			возвСоответствиеСсылок.Вставить(itemXDTO.element, СсылкаНового);
			
			itemXDTO.element=СериализаторXDTO.ЗаписатьXDTO(СсылкаНового);
			itemXDTO.UID=СериализаторXDTO.ЗаписатьXDTO(ПараметрыСеанса.ТекущийПользователь);
			СправочникПараметров=МодульСозданияПараметров.aps_ПолучитьСправочникПараметров(itemXDTO.elementType);
			
			// Дерево свойств, для автозаполнения значений по умолчанию
			ДеревоСвойств = Новый ДеревоЗначений();
			МодульСозданияОбъектов.aps_ОбновитьДеревоСвойств(itemXDTO.elementType, ДеревоСвойств);
			
			Для Каждого parameterXDTO Из МассивПараметровXDTO Цикл 
				Если parameterXDTO.linkParameter<>Истина Тогда 
					СсылкаНовогоПараметра=СправочникПараметров.ПолучитьСсылку();
					возвСоответствиеСсылок.Вставить(parameterXDTO.reference, СсылкаНовогоПараметра);
					parameterXDTO.reference=СериализаторXDTO.ЗаписатьXDTO(СсылкаНовогоПараметра);
					
					СтрокиДереваСвойств = ДеревоСвойств.Строки.НайтиСтроки(Новый Структура("Имя,Свойство",parameterXDTO.description,parameterXDTO.property), Истина);
					Если СтрокиДереваСвойств.Количество() > 0 И ЗначениеЗаполнено(СтрокиДереваСвойств[0].Значение) Тогда 
						parameterXDTO.value = СериализаторXDTO.ЗаписатьXDTO(СтрокиДереваСвойств[0].Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Для i=0 По itemXDTO.presentation.Количество()-1 Цикл
				Если возвСоответствиеСсылок.Получить(itemXDTO.presentation[i])<>Неопределено Тогда 
					itemXDTO.presentation[i]=СериализаторXDTO.ЗаписатьXDTO(возвСоответствиеСсылок[itemXDTO.presentation[i]]);
				КонецЕсли;
			КонецЦикла;
			
			itemXDTO.created  =Истина;
			itemXDTO.modified =Истина;
			
			// добавить потомков для копирования (заимствования)
			МассивПотомковXDTO = aps_НайтиВМоделиXDTO(itemXDTO, Новый Структура("refLinkGroup",Ложь));
			Для i=0 По МассивПотомковXDTO.Количество()-1 Цикл 
				МассивXDTO.Добавить(МассивПотомковXDTO[i]);
			КонецЦикла;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(itemXDTO.link) Тогда
			// создать копию связи в чек-ауте
			ВидЭлементаСвязи=Неопределено;
			Если itemXDTO.linkType = Перечисления.aps_ВидыСвязей.СоставИзделия Тогда 
				ВидЭлементаСвязи = Справочники.aps_ВидыЭлементов.СвязьСостава;
			ИначеЕсли ТипЗнч(itemXDTO.linkType)=Тип("СправочникСсылка.aps_ШаблоныТехнологическихСвязей") И itemXDTO.linkType.ГоризонтальнаяСвязь Тогда 
				ВидЭлементаСвязи = Справочники.aps_ВидыЭлементов.СвязьТехнологии;
			КонецЕсли;
			
			Если ВидЭлементаСвязи = Неопределено Тогда 
				// вертикальная связь
				СсылкаНовойСвязи=Справочники.aps_ВертикальныеСвязи.ПолучитьСсылку();
				возвСоответствиеСсылок.Вставить(itemXDTO.link, СсылкаНовойСвязи);
				itemXDTO.link=СериализаторXDTO.ЗаписатьXDTO(СсылкаНовойСвязи);
			Иначе 
				// элементная связь
				СправочникПараметровСвязи=МодульСозданияПараметров.aps_ПолучитьСправочникПараметров(ВидЭлементаСвязи);
				МассивПараметровXDTO=aps_СформироватьМассивПараметровИзМоделиXDTO(itemXDTO);
				Для Каждого parameterXDTO Из МассивПараметровXDTO Цикл 
					Если parameterXDTO.linkParameter=Истина Тогда 
						СсылкаНовогоПараметра=СправочникПараметровСвязи.ПолучитьСсылку();
						возвСоответствиеСсылок.Вставить(parameterXDTO.reference, СсылкаНовогоПараметра);
						parameterXDTO.reference=СериализаторXDTO.ЗаписатьXDTO(СсылкаНовогоПараметра);
					КонецЕсли;
				КонецЦикла;
				
				СсылкаНовойСвязи=Справочники.aps_ЭлементыСвязей.ПолучитьСсылку();
				возвСоответствиеСсылок.Вставить(itemXDTO.link, СсылкаНовойСвязи);
				itemXDTO.link=СериализаторXDTO.ЗаписатьXDTO(СсылкаНовойСвязи);
			КонецЕсли;
		КонецЕсли;
		
		Если itemXDTO.Владелец()<>Неопределено Тогда 
			itemXDTO.added	  =Истина;
			itemXDTO.deleted  =Неопределено;
			itemXDTO.replaced =Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивXDTO[0];
КонецФункции

// Процедура создает объекты параметров по таблице значений и добавляет их в модель XDTO
// Параметры:
//		itemXDTO - объект модели XDTO
//		Таблица  - ТаблицаЗначений
//		ПринадлежатСвязи - Булево, флаг принадлежности параметров элементу или связи
// Пример:
//      aps_ЗаполнитьПараметрыМоделиПоТаблице(itemXDTO, Параметры, ПринадлежатСвязи);
Процедура aps_ЗаполнитьПараметрыМоделиПоТаблице( itemXDTO, Таблица, ПринадлежатСвязи = Ложь ) Экспорт 
	
	Если Таблица=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СоответствиеГруппПараметров=Новый Соответствие();
	
	ПозДляВставки = Неопределено;
	Для Каждого СтрПараметр Из Таблица Цикл
		parameterGroupXDTO = СоответствиеГруппПараметров.Получить(СтрПараметр.ГруппаПараметров);
		Если parameterGroupXDTO=Неопределено И ЗначениеЗаполнено(СтрПараметр.ГруппаПараметров) Тогда 
			parameterGroupXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "parameter"));
			parameterGroupXDTO.reference	 = СериализаторXDTO.ЗаписатьXDTO(СтрПараметр.ГруппаПараметров);
			parameterGroupXDTO.description	 = СтрПараметр["ИмяГруппыПараметров"];
			parameterGroupXDTO.linkParameter = ПринадлежатСвязи;
			
			Если itemXDTO.parameters.Количество() > 0 И ПозДляВставки <> Неопределено Тогда 
				itemXDTO.parameters.Вставить(ПозДляВставки, parameterGroupXDTO);
				ПозДляВставки = ПозДляВставки + 1;
			Иначе 
				itemXDTO.parameters.Добавить(parameterGroupXDTO);
			КонецЕсли;
			
			СоответствиеГруппПараметров.Вставить(СтрПараметр.ГруппаПараметров, parameterGroupXDTO);
		КонецЕсли;
		
		parameterXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "parameter"));
		
		parameterXDTO.reference		= СериализаторXDTO.ЗаписатьXDTO(СтрПараметр.Параметр);
		parameterXDTO.description	= СтрПараметр["ИмяПараметра"];
		parameterXDTO.property		= СтрПараметр.Свойство;
		parameterXDTO.unit			= СтрПараметр.ЕдиницаИзмерения;
		
		ЗначениеПараметра = СтрПараметр.Значение;
		parameterXDTO.value = ?(ЗначениеЗаполнено(ЗначениеПараметра), СериализаторXDTO.ЗаписатьXDTO(ЗначениеПараметра), Неопределено);
		
		parameterXDTO.linkParameter = ПринадлежатСвязи;
		
		Если parameterGroupXDTO = Неопределено Тогда 
			itemXDTO.parameters.Добавить(parameterXDTO);
			ПозДляВставки = 0;
		Иначе 
			parameterGroupXDTO.parameters.Добавить(parameterXDTO);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура создает объекты параметров по табличной части и добавляет их в модель XDTO
// Параметры:
//		itemXDTO - объект модели XDTO
//		ТабЧасть - Табличная часть
//		ПринадлежатСвязи - Булево, флаг принадлежности параметров элементу или связи
// Пример:
//      aps_ЗаполнитьПараметрыМоделиПоТабЧасти(itemXDTO, itemXDTO.link.Параметры, Истина);
Процедура aps_ЗаполнитьПараметрыМоделиПоТабЧасти( itemXDTO, ТабЧасть, ПринадлежатСвязи = Ложь ) Экспорт 
	Параметры = ТабЧасть.Выгрузить();
	Параметры.Колонки.Добавить("ИмяПараметра");
	Параметры.Колонки.Добавить("Свойство");
	Параметры.Колонки.Добавить("Значение");
	Параметры.Колонки.Добавить("ЕдиницаИзмерения");
	Параметры.Колонки.Добавить("ГруппаПараметров");
	Параметры.Колонки.Добавить("ИмяГруппыПараметров");
	
	// получить параметры в таблицу
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	aps_ПараметрыЭлементовИзделия.Ссылка КАК Параметр,
	                    |	aps_ПараметрыЭлементовИзделия.Наименование КАК ИмяПараметра,
	                    |	aps_ПараметрыЭлементовИзделия.Свойство,
	                    |	aps_ПараметрыЭлементовИзделия.Значение,
	                    |	aps_ПараметрыЭлементовИзделия.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                    |	aps_ПараметрыЭлементовИзделия.Родитель КАК ГруппаПараметров,
	                    |	aps_ПараметрыЭлементовИзделия.Родитель.Наименование КАК ИмяГруппыПараметров
	                    |ИЗ
	                    |	Справочник.aps_ПараметрыЭлементовИзделия КАК aps_ПараметрыЭлементовИзделия
	                    |ГДЕ
	                    |	aps_ПараметрыЭлементовИзделия.Ссылка В(&Параметры)
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	aps_ПараметрыЭлементовТехнологии.Ссылка,
	                    |	aps_ПараметрыЭлементовТехнологии.Наименование,
	                    |	aps_ПараметрыЭлементовТехнологии.Свойство,
	                    |	aps_ПараметрыЭлементовТехнологии.Значение,
	                    |	aps_ПараметрыЭлементовТехнологии.ЕдиницаИзмерения,
	                    |	aps_ПараметрыЭлементовТехнологии.Родитель,
	                    |	aps_ПараметрыЭлементовТехнологии.Родитель.Наименование
	                    |ИЗ
	                    |	Справочник.aps_ПараметрыЭлементовТехнологии КАК aps_ПараметрыЭлементовТехнологии
	                    |ГДЕ
	                    |	aps_ПараметрыЭлементовТехнологии.Ссылка В(&Параметры)");
	Запрос.УстановитьПараметр("Параметры", Параметры.ВыгрузитьКолонку("Параметр"));
	ТаблицаПараметров=Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрПараметр Из Параметры Цикл
		СтрокаИсточник=ТаблицаПараметров.Найти(СтрПараметр.Параметр, "Параметр");
		Если СтрокаИсточник<>Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(СтрПараметр, СтрокаИсточник);
		КонецЕсли;
	КонецЦикла;
	
	// заполнить параметры модели
	aps_ЗаполнитьПараметрыМоделиПоТаблице(itemXDTO, Параметры, ПринадлежатСвязи);
КонецПроцедуры

// Процедура добавляет представление элемента в модель XDTO по табличной части
// Параметры:
//		itemXDTO - объект модели XDTO
//		ТабЧасть - Табличная часть
// Пример:
//       aps_ЗаполнитьПредставлениеМоделиПоТабЧасти(parentXDTO, ПредыдущаяРевизия.ПредставлениеЭлемента);
Процедура aps_ЗаполнитьПредставлениеМоделиПоТабЧасти( itemXDTO, ТабЧасть ) Экспорт 
	Для i=0 По ТабЧасть.Количество()-1 Цикл 
		ПараметрИлиСтрока=ТабЧасть[i].Параметр;
		Если ТипЗнч(ПараметрИлиСтрока)=Тип("Строка") Тогда 
			itemXDTO.presentation.Добавить(СтрЗаменить(ПараметрИлиСтрока, " ", Символы.НПП));
		Иначе
			itemXDTO.presentation.Добавить(?(ПараметрИлиСтрока=Неопределено, Неопределено, СериализаторXDTO.ЗаписатьXDTO(ПараметрИлиСтрока)));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура добавляет представление элемента в модель XDTO по табличной части
// Параметры:
//		itemXDTO - объект модели XDTO
//		ТабЧасть - Табличная часть
// Пример:
//       aps_ЗаполнитьПредставлениеМоделиПоВиду( itemXDTO )
Процедура aps_ЗаполнитьПредставлениеМоделиПоВиду( itemXDTO ) Экспорт 
	МодульСозданияПараметров = Обработки.aps_СозданиеПараметров.Создать();
	
	СписокПараметров = itemXDTO.elementType.ПредставлениеЭлемента.ВыгрузитьКолонку("Свойство");
	Для Каждого ПараметрИлиСтрока Из СписокПараметров Цикл
		Если ТипЗнч(ПараметрИлиСтрока)=Тип("Строка") Тогда 
			itemXDTO.presentation.Добавить(СтрЗаменить(ПараметрИлиСтрока, " ", Символы.НПП));
		Иначе // свойство
			parameterXDTO = МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойствуВXDTO( itemXDTO, ПараметрИлиСтрока );
			Если parameterXDTO <> Неопределено Тогда
				itemXDTO.presentation.Добавить(parameterXDTO.reference);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура создает представление в модели XDTO по представлению элемента или его виду
//
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
// Пример:
//      aps_ОбновитьПредставлениеВМоделиXDTO( itemXDTO )
Процедура aps_ОбновитьПредставлениеВМоделиXDTO( itemXDTO ) Экспорт
	Представление = "";
	МодульСозданияПараметров = Обработки.aps_СозданиеПараметров.Создать();
	
	Если itemXDTO.presentation.Количество() > 0 Тогда 
		СписокПараметров=Новый Массив();
		Для i=0 По itemXDTO.presentation.Количество()-1 Цикл 
			СписокПараметров.Добавить(itemXDTO.presentation[i]);
		КонецЦикла;
	ИначеЕсли itemXDTO.created<>Истина Тогда 
		СписокПараметров=itemXDTO.element.ПредставлениеЭлемента.ВыгрузитьКолонку("Параметр");
	Иначе // новый 
		СписокПараметров=itemXDTO.elementType.ПредставлениеЭлемента.ВыгрузитьКолонку("Свойство");
	КонецЕсли;
	
	Для Каждого ПараметрИлиСтрока Из СписокПараметров Цикл
		Если ТипЗнч(ПараметрИлиСтрока) = Тип("Строка") Тогда 
			Представление = Представление + СтрЗаменить(ПараметрИлиСтрока, Символы.НПП, " ");
		Иначе 
			parameterXDTO = Неопределено;
			Если ТипЗнч(ПараметрИлиСтрока)=Тип("ПланВидовХарактеристикСсылка.aps_Свойства") Тогда 
				parameterXDTO = МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойствуВXDTO(itemXDTO, ПараметрИлиСтрока);
			Иначе
				parameterXDTO = МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСсылкеВXDTO(itemXDTO, ПараметрИлиСтрока);
			КонецЕсли;
			
Если parameterXDTO <> Неопределено Тогда
       ЗначениеПредставления = Строка(parameterXDTO.value);
        КонецЕсли;
		
    Представление = Представление + ЗначениеПредставления;
    
КонецЕсли;

	КонецЦикла;
	
	itemXDTO.description = СокрЛП(Представление);
КонецПроцедуры

// Процедура создает представление в модели XDTO по его виду
//
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
// Пример:
//      aps_ОбновитьПредставлениеПоВидуВМоделиXDTO(itemXDTO);
Процедура aps_ОбновитьПредставлениеПоВидуВМоделиXDTO( itemXDTO ) Экспорт
	aps_ОбновитьПредставлениеВМоделиXDTO( itemXDTO );
КонецПроцедуры

// Процедура устанавливает HTML-контент документа в зависимости от типа файла документа
// Параметры:
//   itemXDTO - объект модели XDTO
// Пример:
//  	aps_ОбновитьHTMLКонтентДокумента(itemXDTO);
Процедура aps_ОбновитьHTMLКонтентДокумента( itemXDTO ) Экспорт
	
	ФайлыДокумента = aps_РаботаСФайламиСервер.aps_ПолучитьФайлыДокумента(itemXDTO.element);
	Если ФайлыДокумента.Количество() > 0 Тогда 
		Файл = ФайлыДокумента[0].Ссылка;
	Иначе 
		Файл = Справочники.aps_Файлы.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ Файл.Пустая() И НЕ Файл.ЭтоГруппа Тогда
		
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Файл);
		ПараметрыВыгрузкиФайла = aps_РаботаСФайлами.aps_СформироватьСтруктуруПараметровВыгрузки();
		ПараметрыВыгрузкиФайла.РежимПерезаписи = 2; // перезаписать для всех
		ВыгруженныеФайлы = aps_РаботаСФайлами.aps_ВыгрузкаФайловНаДиск(КаталогВременныхФайлов(), МассивФайлов, ПараметрыВыгрузкиФайла);
		Если ВыгруженныеФайлы = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ПолноеИмяФайла = ВыгруженныеФайлы.Получить(Файл);
		локHTMLКонтент = "";
		
		Если ВРЕГ(Файл.Расширение) = ".BMP" Или
				ВРЕГ(Файл.Расширение) = ".PNG" Или
				ВРЕГ(Файл.Расширение) = ".GIF" Или
				ВРЕГ(Файл.Расширение) = ".TIF" Или
				ВРЕГ(Файл.Расширение) = ".TIFF" Или
				ВРЕГ(Файл.Расширение) = ".JPG" Или
				ВРЕГ(Файл.Расширение) = ".JPEG" Или
				ВРЕГ(Файл.Расширение) = ".ICO" Или
				ВРЕГ(Файл.Расширение) = ".EMF" Или
				ВРЕГ(Файл.Расширение) = ".WMF" Тогда 
			// Файлы изображений
			локHTMLКонтент = "<div style=""text-align:center;width:100%;height:100%;""><img src="""+ПолноеИмяФайла+""" style=""width:auto;"" /></div>";
			
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".AVI" Или
					ВРЕГ(Файл.Расширение) = ".MOV" Или
					ВРЕГ(Файл.Расширение) = ".WMV" Или
					ВРЕГ(Файл.Расширение) = ".MPG" Или
					ВРЕГ(Файл.Расширение) = ".MPEG" Тогда 
			// Видео-файлы
			локHTMLКонтент = 
				"<object classid=""CLSID:6BF52A52-394A-11D3-B153-00C04F79FAA6"" width=""100%"" height=""100%"">
				|<param name=""url"" value="""+ПолноеИмяФайла+""">
				|</object>";
				
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".PDF" Тогда 
			// Файлы документации
			локHTMLКонтент = 
				"<object classid=""CLSID:CA8A9780-280D-11CF-A24D-444553540000"" width=""100%"" height=""100%"">
				|<param name=""src"" value="""+ПолноеИмяФайла+""">
				|</object>";
				
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".EASM" Или ВРЕГ(Файл.Расширение) = ".EPRT" Или ВРЕГ(Файл.Расширение) = ".EDRW"
					ИЛИ ВРЕГ(Файл.Расширение) = ".SLDASM" Или ВРЕГ(Файл.Расширение) = ".SLDPRT" Или ВРЕГ(Файл.Расширение) = ".SLDDRW" Тогда 
			// eDrawings
			локHTMLКонтент = 
				"<object classid=""CLSID:38EA7638-39D0-44F8-AA3D-E64505B2E6E0"" width=""100%"" height=""100%"">
				|<param name=""_cx"" value=""5080"">
				|<param name=""_cy"" value=""5080"">
				|<param name=""EnableFeatures"" value=""0"">
				|<param name=""Filename"" value="""+ПолноеИмяФайла+""">
				|<param name=""FullUI"" value=""0"">
				|</object>";
				
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".ASM" Или 
					ВРЕГ(Файл.Расширение) = ".PRT" Тогда 
			// Pro/ENGINEER
			локHTMLКонтент = 
				"<object classid=""CLSID:D18F058C-496D-40C7-8F57-37881D3C5EFF"" width=""100%"" height=""100%"">
				|<param name=""src"" value="""+ПолноеИмяФайла+""">
				|</object>";
			
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".SPW" Или ВРЕГ(Файл.Расширение) = ".M3D" Или ВРЕГ(Файл.Расширение) = ".A3D" Или
					ВРЕГ(Файл.Расширение) = ".CDW" Или ВРЕГ(Файл.Расширение) = ".FRW" Тогда 
			// КОМПАС
			локHTMLКонтент = 
				"<object classid=""CLSID:6B943E71-5CA2-435D-AFA3-D7817B13ACA2"" width=""100%"" height=""100%"">
				|<param name=""DocumentFileName"" value="""+ПолноеИмяФайла+""">
				|</object>";
		ИначеЕсли ВРЕГ(Файл.Расширение) = ".TXT" Или ВРЕГ(Файл.Расширение) = ".LOG" Или ВРЕГ(Файл.Расширение) = ".INI" Тогда 
			// Текстовые документы
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ПолноеИмяФайла);
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			Текст = СтрЗаменить(Текст,"""","&quot;");
			Текст = СтрЗаменить(Текст,"<","&lt;");
			Текст = СтрЗаменить(Текст,">","&gt;");
			локHTMLКонтент = "<textarea readonly style=""width:100%; height:100%"">"+Текст+"</textarea>";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(локHTMLКонтент) Тогда 
		СтрокаПустогоСодержимого=НСтр("ru = 'Файлы отсутствуют или нет права просмотра.'; en_US = 'No files or access denied.'");
		локHTMLКонтент="<span class=""grayTextStyle"">"+СтрокаПустогоСодержимого+"</span>";
	КонецЕсли;
	
	НавСсылкаКонтент = ПолучитьНавигационнуюСсылкуИнформационнойБазы()+"/"+ПоместитьВоВременноеХранилище("<html><body>"+локHTMLКонтент+"</body></html>");
	itemXDTO.htmlContent = "<iframe width=""100%"" height=""100%"" src="""+НавСсылкаКонтент+"""></iframe>"
			
КонецПроцедуры

// Процедура перечитывает данные из БД в модель данных
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
// Пример:
//     	aps_ОбновитьДанныеМоделиXDTO(itemXDTO);
Процедура aps_ОбновитьДанныеМоделиXDTO( itemXDTO ) Экспорт 
	
	item = itemXDTO.element;
	Если item = Неопределено ИЛИ item.ПолучитьОбъект() = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	itemXDTO.pictureIndex = ?(item.ИндексКартинки=0, item.ВидЭлемента.ИндексКартинки, item.ИндексКартинки);
	itemXDTO.elementType  = item.ВидЭлемента;
	
	itemXDTO.description = item.Наименование;
	itemXDTO.htmlContent = item.HTMLКонтент;
	
	itemXDTO.pictureBinaryData = Неопределено;
	
	itemXDTO.UID		 = ?(ЗначениеЗаполнено(item.UID), СериализаторXDTO.ЗаписатьXDTO(item.UID), Неопределено);
	itemXDTO.GID		 = ?(ЗначениеЗаполнено(item.GID), СериализаторXDTO.ЗаписатьXDTO(item.GID), Неопределено);
	
	ПараметрыСвязиXDTO=Новый Массив;
	Для i=0 По itemXDTO.parameters.Количество()-1 Цикл 
		Если itemXDTO.parameters[i].linkParameter=Истина Тогда 
			ПараметрыСвязиXDTO.Добавить(itemXDTO.parameters[i]);
		КонецЕсли;
	КонецЦикла;
	
	itemXDTO.parameters.Очистить();
	aps_ЗаполнитьПараметрыМоделиПоТабЧасти(itemXDTO, item.Параметры);
	
	// добавить параметры связи в модель
	Для Каждого parameterXDTO Из ПараметрыСвязиXDTO Цикл 
		itemXDTO.parameters.Добавить(parameterXDTO);
	КонецЦикла;
	
	itemXDTO.presentation.Очистить();
	
КонецПроцедуры

// Процедура добавляет XDTO-модель в модель родителя по виду связи
// Параметры:
//		parentItemXDTO	- ОбъектXDTO, объект модели XDTO родителя
//		itemXDTO		- ОбъектXDTO, объект модели XDTO
//		ВыбШаблонСвязи	- ПеречислениеСсылка.aps_ВидыСвязей, СправочникСсылка.aps_ШаблоныТехнологическихСвязей, вид или шаблон связи
// Пример:
//		aps_ЗаимствоватьВМодельXDTO(parentXDTO, itemXDTO, Справочники.aps_ШаблоныТехнологическихСвязей.Ресурсы);
Процедура aps_ЗаимствоватьВМодельXDTO(parentItemXDTO, itemXDTO, ВыбШаблонСвязи) Экспорт 
	ПозДляВставки=Неопределено; // определить позицию для вставки объекта
	aps_НайтиВМассивеXDTO(parentItemXDTO.items, Новый Структура("refLinkGroup", Истина), ПозДляВставки);
	
	ВидЭлементаСвязи=Неопределено;
	Если ВыбШаблонСвязи = Перечисления.aps_ВидыСвязей.СоставИзделия Тогда 
		ВидЭлементаСвязи = Справочники.aps_ВидыЭлементов.СвязьСостава;
	ИначеЕсли ТипЗнч(ВыбШаблонСвязи)=Тип("СправочникСсылка.aps_ШаблоныТехнологическихСвязей") И ВыбШаблонСвязи.ГоризонтальнаяСвязь Тогда 
		ВидЭлементаСвязи = Справочники.aps_ВидыЭлементов.СвязьТехнологии;
	КонецЕсли;
	
	// найти существующую группу связей в модели родителя
	itemRefXDTO = aps_НайтиВМассивеXDTO(parentItemXDTO.items, Новый Структура("refLinkGroup, linkType", Истина, ВыбШаблонСвязи));
	Если itemRefXDTO = Неопределено И ВидЭлементаСвязи=Справочники.aps_ВидыЭлементов.СвязьТехнологии Тогда 
		// создать новую группу горизонтальных связей
		itemRefXDTO = aps_СоздатьОбъектМоделиXDTO(ВыбШаблонСвязи);
		parentItemXDTO.items.Добавить(itemRefXDTO);
	КонецЕсли;
	
	itemXDTO.added		= Истина;
	itemXDTO.deleted	= Неопределено; // если заимствуется удаленный
	itemXDTO.replaced	= Неопределено; // если заимствуется замененный
	
	itemXDTO.link		= ?(ВидЭлементаСвязи<>Неопределено, СериализаторXDTO.ЗаписатьXDTO(Справочники.aps_ЭлементыСвязей.ПолучитьСсылку()), Неопределено);
	itemXDTO.linkType	= СериализаторXDTO.ЗаписатьXDTO(ВыбШаблонСвязи);
	// удалить параметры связи из модели XDTO
	aps_УдалитьИзМассиваXDTO(itemXDTO.parameters, Новый Структура("linkParameter", Истина));
	
	Если ВидЭлементаСвязи <> Неопределено Тогда 
		МодульСозданияОбъектов=Обработки.aps_СозданиеОбъектов.Создать();
		
		ДеревоСвойствСвязи=Новый ДеревоЗначений();
		МодульСозданияОбъектов.aps_ОбновитьДеревоСвойств(ВидЭлементаСвязи, ДеревоСвойствСвязи, ВыбШаблонСвязи);
		МодульСозданияОбъектов.aps_СозданиеПараметровXDTOПоДереву(ДеревоСвойствСвязи.Строки, itemXDTO, Истина);
	КонецЕсли;
	
	Если itemRefXDTO <> Неопределено Тогда 
		itemRefXDTO.items.Добавить(itemXDTO);
	ИначеЕсли ПозДляВставки <> Неопределено Тогда 
		parentItemXDTO.items.Вставить(ПозДляВставки, itemXDTO);
		ПозДляВставки = ПозДляВставки + 1;
	Иначе 
		parentItemXDTO.items.Добавить(itemXDTO);
	КонецЕсли;
	
	parentItemXDTO.modified=Истина;
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСписками

// Функция преобразует многоуровневую модель XDTO в линейный массив
// Параметры:
//		itemXDTO - объект модели XDTO
// Возвращаемое значение:
//		Массив
// Пример:
//      МассивИзделийXDTO=aps_СформироватьМассивИзМоделиXDTO(itemXDTO);
//
Функция aps_СформироватьМассивИзМоделиXDTO( itemXDTO, возвМассив = Неопределено ) Экспорт 
	Если возвМассив=Неопределено Тогда 
		возвМассив=Новый Массив();
	КонецЕсли;
	возвМассив.Добавить(itemXDTO);
	Для Каждого childItemXDTO Из itemXDTO.items Цикл
		aps_СформироватьМассивИзМоделиXDTO( childItemXDTO, возвМассив );
	КонецЦикла;
	Возврат возвМассив;
КонецФункции

// Функция преобразует многоуровневую модель параметров XDTO в линейный массив
// Параметры:
//		itemXDTO - объект модели XDTO
// Возвращаемое значение:
//		Массив
// Пример:
//		МассивXDTO = aps_СформироватьМассивИзМоделиXDTO(parentXDTO);
Функция aps_СформироватьМассивПараметровИзМоделиXDTO( itemXDTO, возвМассив = Неопределено, ПринадлежатСвязи = Неопределено ) Экспорт 
	Если возвМассив=Неопределено Тогда 
		возвМассив=Новый Массив();
	КонецЕсли;
	Для Каждого parameterXDTO Из itemXDTO.parameters Цикл 
		Если ПринадлежатСвязи<>Неопределено И parameterXDTO.linkParameter<>ПринадлежатСвязи Тогда 
			Продолжить;
		КонецЕсли;		
		
		возвМассив.Добавить(parameterXDTO);
		Если parameterXDTO.property=Неопределено Тогда // группа параметров
			aps_СформироватьМассивПараметровИзМоделиXDTO( parameterXDTO, возвМассив );
		КонецЕсли;
	КонецЦикла;
	Возврат возвМассив;
КонецФункции

// Функция находит и возвращает объект модели XDTO по заданному набору условий
// Параметры:
//		itemXDTOArray - Массив, СписокXDTO
//		СтруктураОтбора - Структура
// Возвращаемое значение:
//		ОбъектXDTO, Неопределено
// Пример:
//    	itemXDTO = aps_НайтиВМассивеXDTO(ТехпроцессИлиМаршрутXDTO.items, СтруктураОтбора);
//
Функция aps_НайтиВМассивеXDTO( itemXDTOArray, СтруктураОтбора, возвПорядковыйНомер = Неопределено ) Экспорт
	Для i=0 По itemXDTOArray.Количество()-1 Цикл
		itemXDTO = itemXDTOArray[i];
		Ненайдено = Ложь;
		Для Каждого КлючИЗн Из СтруктураОтбора Цикл
			Выполнить "Если itemXDTO."+КлючИЗн.Ключ+" <> КлючИЗн.Значение Тогда Ненайдено = Истина; КонецЕсли;";
			Если Ненайдено = Истина Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Ненайдено = Ложь Тогда
			возвПорядковыйНомер = i;
			Возврат itemXDTO;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Функция находит и возвращает массив объектов XDTO в модели по заданному набору условий
// Параметры:
//		itemXDTO - ОбъектXDTO, объект модели XDTO
//		СтруктураОтбора - Структура
//		возвМассивXDTO - Массив, существующий массив
// Возвращаемое значение:
//		Массив
// Пример:
//    МассивПодчиненныхXDTO=aps_НайтиВМоделиXDTO(Строка.ОбъектXDTO, Новый Структура("refLinkGroup",Ложь));
Функция aps_НайтиВМоделиXDTO( parentXDTO, СтруктураОтбора, возвМассивXDTO = Неопределено, ЗаходитьВГоризонтальныеСвязи = Истина, ИскатьПоВсемУровням = Ложь ) Экспорт 
	Если возвМассивXDTO = Неопределено Тогда 
		возвМассивXDTO = Новый Массив;
	КонецЕсли;
	Для Каждого itemXDTO Из parentXDTO.items Цикл
		Если ЗаходитьВГоризонтальныеСвязи И itemXDTO.refLinkGroup Тогда
			aps_НайтиВМоделиXDTO(itemXDTO, СтруктураОтбора, возвМассивXDTO, ЗаходитьВГоризонтальныеСвязи, ИскатьПоВсемУровням);
		Иначе
			Ненайдено = Ложь;
			Для Каждого КлючИЗн Из СтруктураОтбора Цикл
				Выполнить "Если itemXDTO."+КлючИЗн.Ключ+" <> КлючИЗн.Значение Тогда Ненайдено = Истина; КонецЕсли;";
				Если Ненайдено = Истина Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Ненайдено = Ложь Тогда
				возвМассивXDTO.Добавить(itemXDTO);
			КонецЕсли;
		КонецЕсли;
		Если ИскатьПоВсемУровням И НЕ itemXDTO.refLinkGroup Тогда
			aps_НайтиВМоделиXDTO(itemXDTO, СтруктураОтбора, возвМассивXDTO, ЗаходитьВГоризонтальныеСвязи, ИскатьПоВсемУровням);
		КонецЕсли;
	КонецЦикла;
	Возврат возвМассивXDTO;
КонецФункции

// Функция удаляет объекты XDTO из списка по заданному набору условий
// Параметры:
//		itemXDTOArray	- Массив, СписокXDTO
//		СтруктураОтбора	- Структура, ОбъектXDTO (если известен сам объект)
// Возвращаемое значение:
//		Булево - Истина, если удалено
// Пример:
//		aps_УдалитьИзМассиваXDTO(itemXDTO.parameters, Новый Структура("linkParameter", Истина));
Функция aps_УдалитьИзМассиваXDTO( itemXDTOArray, СтруктураОтбора ) Экспорт
	i=0;
	Пока i < itemXDTOArray.Количество() Цикл
		itemXDTO = itemXDTOArray[i];
		Если ТипЗнч(СтруктураОтбора)=Тип("Структура") Тогда 
			Ненайдено = Ложь;
			Для Каждого КлючИЗн Из СтруктураОтбора Цикл
				Выполнить "Если itemXDTO."+КлючИЗн.Ключ+" <> КлючИЗн.Значение Тогда Ненайдено = Истина; КонецЕсли;";
				Если Ненайдено = Истина Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе 
			Ненайдено = itemXDTO<>СтруктураОтбора;
		КонецЕсли;
		
		Если Ненайдено = Ложь Тогда
			itemXDTOArray.Удалить(i);
		Иначе 
			i=i+1;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СериализацияXML

// Функция сериализует XDTO в строку XML
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		Строка
// Пример:
//  Строка1=XDTO2Строка( item );
Функция XDTO2Строка( XDTO ) Экспорт
	Если XDTO = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, XDTO, XDTO.Тип().Имя, XDTO.Тип().URIПространстваИмен,, НазначениеТипаXML.Явное);
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Функция десериализует строку XML в объект XDTO
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		Xdto 
// Пример:
//  xdto=Строка2XDTO( Строка1 )
Функция Строка2XDTO( ИсхСтрока ) Экспорт
	Если ПустаяСтрока( ИсхСтрока ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ИсхСтрока);
	XDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Возврат XDTO;
КонецФункции

// Функция сериализует XDTO в файл XML
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		Строка
// Пример:
//   XDTO2Файл( item, "test" )
Функция XDTO2Файл( XDTO, ПолноеИмяФайла ) Экспорт
	Если XDTO = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, XDTO, XDTO.Тип().Имя, XDTO.Тип().URIПространстваИмен,, НазначениеТипаXML.Явное);
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Функция десериализует файл XML в объект XDTO
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		xdto
// Пример:
//   xdto= Файл2XDTO( "test" )
Функция Файл2XDTO( ПолноеИмяФайла ) Экспорт
	Если ПустаяСтрока( ПолноеИмяФайла ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	XDTO=ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Возврат XDTO;
КонецФункции

// Функция сериализует значения 8.* в строку XML
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		строка
// Пример:
//  Строка=Object1С2Строка( Объект )
Функция Object1С2Строка( Object1С ) Экспорт 
	Если Object1С = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Object1С, НазначениеТипаXML.Явное);
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Функция десериализует строку XML в значение 8.*
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		Объект
// Пример:
//   	Объект=Строка2Object1С( Строка);
Функция Строка2Object1С( ИсхСтрока ) Экспорт 
	Если ПустаяСтрока( ИсхСтрока ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ИсхСтрока);
	Object1С = ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Возврат Object1С;
КонецФункции

// Функция сериализует XSD-схему в строку XML
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		Строка
// Пример:
//     XDS2Строка( xsd )
Функция XSD2Строка( XSD ) Экспорт 
	Если XSD = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьDOM = Новый ЗаписьDOM;
	XSD.ОбновитьЭлементDOM();
	ЗаписьDOM.Записать(XSD.ДокументDOM, ЗаписьXML);
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Функция десериализует строку XML в XSD-схему
// Параметры:
// 		XDTO - объект XDTO
// Возвращаемое значение:
//		xsd
// Пример:
//      Строка2XSD( Строка )
Функция Строка2XSD( ИсхСтрока ) Экспорт 
	Если ПустаяСтрока( ИсхСтрока ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ИсхСтрока);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ПостроительСхем = Новый ПостроительСхемXML;
	Возврат ПостроительСхем.СоздатьСхемуXML(ДокументDOM);
КонецФункции

// Функция создает объекты параметров по дереву значений и добавляет их в модель XDTO
// Параметры:
//		itemXDTO - объект модели XDTO
//		СтрокиДерева  - КоллекцияСтрокДереваЗначений
// Возвращаемое значение:
//		Нет
// Пример:
//		aps_ЗаполнитьПараметрыМоделиПоДереву( parameterXDTO, СтрокаДерева.Строки );
Функция aps_ЗаполнитьПараметрыМоделиПоДереву( itemXDTO, СтрокиДерева ) Экспорт 
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл 
		parameterXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://appius.ru/pdm", "parameter"));
		
		parameterXDTO.reference		= СериализаторXDTO.ЗаписатьXDTO(СтрокаДерева.Ссылка);
		parameterXDTO.description	= СтрокаДерева.Имя;
		parameterXDTO.linkParameter = СтрокаДерева.ЭтоПараметрСвязи;
		
		Если ЗначениеЗаполнено(СтрокаДерева.Свойство) Тогда 
			parameterXDTO.property		= СтрокаДерева.Свойство;
			parameterXDTO.unit			= СтрокаДерева.ЕдиницаИзмерения;
			
			ЗначениеПараметра = СтрокаДерева.Значение;
			parameterXDTO.value = ?(ЗначениеЗаполнено(ЗначениеПараметра), СериализаторXDTO.ЗаписатьXDTO(ЗначениеПараметра), Неопределено);
		Иначе // группа параметров
			aps_ЗаполнитьПараметрыМоделиПоДереву( parameterXDTO, СтрокаДерева.Строки );
		КонецЕсли;
		
		itemXDTO.parameters.Добавить(parameterXDTO);
	КонецЦикла;
КонецФункции

// Функция преобразует ДанныеФормыСтрокаДерева в объект XDTO
// Параметры:
//		ЭлементДерева - ДанныеФормыЭлементДерева
//		КолУровней - Число, Неопределено. Если Неопределено, преобразует все уровни
// Возвращаемое значение:
//		ОбъектXDTO
// Пример:
//		 parentXDTO = ЭлементДерева2XDTO(СтрокаДерева);
Функция ЭлементДерева2XDTO( ЭлементДерева, КолУровней = 0 ) Экспорт
	
	ИсточникДанных = Новый Структура;
	
	Если ЭлементДерева.ЭлементСсылка = Неопределено Тогда
		
		ИсточникДанных.Вставить("КартинкаСвязи"		, ЭлементДерева.Картинка);
		ИсточникДанных.Вставить("ПредставлениеСвязи", Строка(ЭлементДерева.ВидСвязи));
		ИсточникДанных.Вставить("ВидСвязи"			, ЭлементДерева.ВидСвязи);
		
		// html-шаблоны
		ИсточникДанных.Вставить("ФайлШаблонаПросмотраСвязи"	, "");
		ИсточникДанных.Вставить("ФайлШаблонаДействийСвязи"	, "");
		
		itemXDTO = aps_СоздатьОбъектМоделиXDTO(ЭлементДерева.ВидСвязи, ИсточникДанных);
		
	Иначе 
		
		// html-шаблоны
		ИсточникДанных.Вставить("ФайлШаблонаПросмотра"		, "");
		ИсточникДанных.Вставить("ФайлШаблонаРедактирования"	, "");
		ИсточникДанных.Вставить("ФайлШаблонаДействий"		, "");
		
		ИсточникДанных.Вставить("ЭлементСсылка"		, ЭлементДерева.ЭлементСсылка);
		ИсточникДанных.Вставить("ВидЭлемента"		, ЭлементДерева.ВидЭлемента);
		ИсточникДанных.Вставить("Картинка"			, ЭлементДерева.Картинка);
		ИсточникДанных.Вставить("ПредставлениеЭлемента", ЭлементДерева.Представление);
		ИсточникДанных.Вставить("Владелец"			, Неопределено);
		ИсточникДанных.Вставить("Группа"			, Неопределено);
		ИсточникДанных.Вставить("HTMLКонтент"		, Неопределено);
		ИсточникДанных.Вставить("ПорядокВывода"		, ЭлементДерева.ПорядокВывода);
		
		Если ТипЗнч(ИсточникДанных.ЭлементСсылка)=Тип("СправочникСсылка.aps_ЭлементыИзделия") Тогда 
			ИсточникДанных.Вставить("ПараметрыЭлементаИзделия"		, Новый ТаблицаЗначений);
		ИначеЕсли ТипЗнч(ИсточникДанных.ЭлементСсылка)=Тип("СправочникСсылка.aps_ЭлементыСправочников") Тогда 
			ИсточникДанных.Вставить("ПараметрыЭлементаСправочника"	, Новый ТаблицаЗначений);
		Иначе 
			ИсточникДанных.Вставить("ПараметрыЭлементаТехнологии"	, Новый ТаблицаЗначений);
		КонецЕсли;
	
		itemXDTO = aps_СоздатьОбъектМоделиXDTO(ЭлементДерева.ЭлементСсылка, ИсточникДанных);
		itemXDTO.link		= ?(ЗначениеЗаполнено(ЭлементДерева.ЭлементСвязи), СериализаторXDTO.ЗаписатьXDTO(ЭлементДерева.ЭлементСвязи), Неопределено);
		itemXDTO.linkType	= ?(ЗначениеЗаполнено(ЭлементДерева.ВидСвязи), СериализаторXDTO.ЗаписатьXDTO(ЭлементДерева.ВидСвязи), Неопределено);
		
		aps_ЗаполнитьПараметрыМоделиПоДереву(itemXDTO, ДанныеФормыВЗначение(ЭлементДерева.Параметры, Тип("ДеревоЗначений")).Строки);
		
	КонецЕсли;
		
	Если КолУровней = Неопределено Или КолУровней > 0 Тогда 
		Для Каждого ПодчиненныйЭлементДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
			itemXDTO.items.Добавить(ЭлементДерева2XDTO(ПодчиненныйЭлементДерева, ?(КолУровней<>Неопределено, КолУровней-1, КолУровней)));
		КонецЦикла;
	КонецЕсли;
	
	Возврат itemXDTO;
КонецФункции

#КонецОбласти

#КонецЕсли


