// ----------------------------------------------
// Система управления инженерными данными 1С:PDM
// -----------------------------------------------
// Разработка компании Appius, www.appius.ru
// -----------------------------------------------

#Если НЕ МобильноеПриложениеСервер Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура выполняет код события
//
// Параметры:
//		ТипСобытия - перечисления типы событий
//		СтруктураПараметровСобытия - структура
// Пример:
//		aps_ОбработчикиСобытий.aps_ВыполнитьСобытие(Перечисления.aps_События.ПриСозданииСпецификацииНоменклатуры, aps_СтруктураПараметровОповещения);
//
Процедура aps_ВыполнитьСобытие( ТипСобытия, СтруктураПараметровСобытия, ИмяСобытия="", Отказ=Ложь ) Экспорт
	// объявление локальной переменной для выполнения кода события
	aps_СтруктураПараметровОповещения=СтруктураПараметровСобытия;
	Если aps_СтруктураПараметровОповещения.Свойство("itemObject") И aps_СтруктураПараметровОповещения.itemObject<>Неопределено Тогда 
		itemObject = aps_СтруктураПараметровОповещения.itemObject;
	КонецЕсли;
	
	ОтборСобытий = Новый Структура("ТипСобытия", ТипСобытия);
	Если СтрДлина(ИмяСобытия)<>0 Тогда 
		ОтборСобытий.Вставить("ИмяСобытия", ИмяСобытия);
	КонецЕсли;
	
	События = ПараметрыСеанса.aps_КэшСобытий.Получить();
	События = События.НайтиСтроки(ОтборСобытий);
	Для Каждого Событие Из События Цикл
		Попытка
			Выполнить Событие.КодСобытия;
		Исключение
			Если Событие.ВызватьИсключение Тогда 
				ВызватьИсключение;
			Иначе 
				Сообщить(НСтр("ru = 'Ошибка при выполнении фрагмента кода в событии ""'; en_US = 'Error on code fragment executing in ""'")+Строка(Событие.ЭлементСобытия)+НСтр("ru = '"":'; en_US = '"" event:'")+Символы.ПС+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),СтатусСообщения.Внимание);
				Отказ=Истина;
			КонецЕсли;
		КонецПопытки;
		
		// выполнить каскадные события
		Для Каждого КаскадноеСобытие Из Событие.КаскадныеСобытия Цикл
			Попытка
				Выполнить КаскадноеСобытие.КодСобытия;
			Исключение
				Если КаскадноеСобытие.ВызватьИсключение Тогда 
					ВызватьИсключение;
				Иначе 
					Сообщить(НСтр("ru = 'Ошибка при выполнении фрагмента кода в событии ""'; en_US = 'Error on code fragment executing in ""'")+Строка(КаскадноеСобытие.ЭлементСобытия)+НСтр("ru = '"":'; en_US = '"" event:'")+Символы.ПС+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),СтатусСообщения.Внимание);
					Отказ=Истина;
				КонецЕсли;
			КонецПопытки;
		КонецЦикла;
		
		Если Событие.РассылкаВключена Тогда 
			ЗаписьЖурналаРегистрации("APPIUS.PDM.Событие."+Строка(Событие.ЭлементСобытия.УникальныйИдентификатор()),
									 УровеньЖурналаРегистрации.Информация,
									 ,
									 ?(itemObject=Неопределено, Неопределено, itemObject.Ссылка),
									 Событие.ИмяСобытия);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция формирует наименования элемента
// 
// Параметры
//		item - ссылка на элемент изделия или технологии по ТЧ представления
// Возвращаемое значение:
//		Сформированное наименование	
// Пример:
//		Источник.Наименование = aps_ФормированиеНаименованияЭлемента(Источник);
//
Функция aps_ФормированиеНаименованияЭлемента( item ) Экспорт
	НаименованиеЭлемента = "";
	Для Каждого СтрокаПредставления Из item.ПредставлениеЭлемента Цикл
		Если СтрокаПредставления.Параметр = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредставления.Параметр) = Тип("Строка") Тогда
			НаименованиеЭлемента = НаименованиеЭлемента + СтрЗаменить(СтрокаПредставления.Параметр,Символы.НПП, " ");
		ИначеЕсли ТипЗнч(СтрокаПредставления.Параметр) = Тип("СправочникСсылка.aps_ПараметрыЭлементовИзделия")
					Или ТипЗнч(СтрокаПредставления.Параметр) = Тип("СправочникСсылка.aps_ПараметрыЭлементовТехнологии") Тогда 
			НаименованиеЭлемента = НаименованиеЭлемента + Строка(СтрокаПредставления.Параметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(НаименованиеЭлемента);
КонецФункции
 
// Обработчик подписок события справочника перед записью
//
// Параметры
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//		aps_СправочникЭлементовПередЗаписью(Источник, Отказ);
//
Процедура aps_СправочникЭлементовПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда
		Источник.Дата = ТекущаяДата();
	КонецЕсли;
	
	Источник.Наименование = aps_ФормированиеНаименованияЭлемента( Источник );
	
	Если Источник.ВидЭлемента.НастройкаПроверкиУникальности.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	ФлагПроверкиУникальности=(ПараметрыСеанса.aps_ПроверкаУникальностиВключена=Истина 
								И Константы.aps_ПроверкаУникальностиВключена.Получить()=Истина);
								
	Если Источник.ДополнительныеСвойства.Свойство("ПроверитьУникальность") И Источник.ДополнительныеСвойства.ПроверитьУникальность=Ложь Тогда 
		ФлагПроверкиУникальности=Ложь;
	КонецЕсли;
		
	Если НЕ Источник.ПометкаУдаления И ФлагПроверкиУникальности Тогда 
		СуществующиеЭлементы = aps_Итераторы.aps_ПроверкаУникальности(Object1С2Строка(Источник));
		Если СуществующиеЭлементы.Количество() > 0 Тогда 
			Источник.ДополнительныеСвойства.Вставить("СуществующийЭлемент", СуществующиеЭлементы[0].ЭлементСсылка);
			ВызватьИсключение НСтр("ru = 'Элемент <'; en_US = 'The <'")+Источник.Наименование+НСтр("ru = '> не уникален!'; en_US = '> is not unique!'")+" "+НСтр("ru = 'Существующий элемент: <'; en_US = 'The existing item: <'")+Строка(СуществующиеЭлементы[0].ЭлементСсылка)+">.";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обработчик подписок события справочника при записи
//
// Параметры:
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//      aps_СправочникЭлементовПриЗаписи(Источник, Отказ);
//
Процедура aps_СправочникЭлементовПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоНовый() Тогда
		Источник.ИндексВерсии=1;
	Иначе
		Источник.ИндексВерсии=Источник.ИндексВерсии+1;
	КонецЕсли;
	
	Если Константы.aps_Штрихкодирование.Получить() <> Истина Тогда 
		Возврат;
	КонецЕсли;
	
		
	// Формирование штрихкода
	Если Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.Документ
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежSolidWorks
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальSolidWorks
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаSolidWorks
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежКОМПАС
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальКОМПАС
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаКОМПАС
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежAutoCAD
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальAutoCAD
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаAutoCAD
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежInventor
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальInventor
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаInventor
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументЧертежSolidEdge
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументДетальSolidEdge
			ИЛИ Источник.ВидЭлемента = Справочники.aps_ВидыЭлементов.АктивныйДокументСборкаSolidEdge Тогда

		
		Если НЕ Источник.ЭтоНовый() Тогда // Проверка существования записи
			ЗапросСущШтрихкода = Новый Запрос("ВЫБРАТЬ
			                               |	aps_ШтрихкодыДокументов.Штрихкод КАК Штрихкод,
			                               |	aps_ШтрихкодыДокументов.ЭлементСсылка
			                               |ИЗ
			                               |	РегистрСведений.aps_ШтрихкодыДокументов КАК aps_ШтрихкодыДокументов
			                               |ГДЕ
			                               |	aps_ШтрихкодыДокументов.ЭлементСсылка = &ЭлементСсылка
			                               |	И aps_ШтрихкодыДокументов.Штрихкод <> 0");
			ЗапросСущШтрихкода.УстановитьПараметр("ЭлементСсылка", Источник.Ссылка);
			Если НЕ ЗапросСущШтрихкода.Выполнить().Пустой() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьШтрихкода = РегистрыСведений.aps_ШтрихкодыДокументов.СоздатьМенеджерЗаписи();
		ЗаписьШтрихкода.ЭлементСсылка = Источник.Ссылка;
		
		ЗапросШтрихкода = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                               |	aps_ШтрихкодыДокументов.Штрихкод КАК Штрихкод
		                               |ИЗ
		                               |	РегистрСведений.aps_ШтрихкодыДокументов КАК aps_ШтрихкодыДокументов
		                               |ГДЕ
		                               |	aps_ШтрихкодыДокументов.Штрихкод <> 0
		                               |
		                               |УПОРЯДОЧИТЬ ПО
		                               |	Штрихкод УБЫВ");
		Результат = ЗапросШтрихкода.Выполнить().Выгрузить();
		Если Результат.Количество() = 0 Тогда
			ЗаписьШтрихкода.Штрихкод = 2111111111115;
		Иначе
			СледующийКод = Строка(Формат(Число(Лев(Строка(Формат(Результат[0].Штрихкод, "ЧГ=0")), 12)) + 1, "ЧГ=0"));
			
			// Вычисление контрольной суммы типа ШК EAN13
			Четн   = 0;
			Нечетн = 0;

			Для Индекс = 1 По 6 Цикл
				Четн   = Четн   + Сред(СледующийКод, 2 * Индекс, 1);
				Нечетн = Нечетн + Сред(СледующийКод, 2 * Индекс - 1, 1);
			КонецЦикла;
			
			Четн = Четн * 3;
			КонтЦифра = 10 - (Четн + Нечетн) % 10;
			КонтЦифра = ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
			
			ЗаписьШтрихкода.Штрихкод = Число(СледующийКод + КонтЦифра);
		КонецЕсли;
		
		ЗаписьШтрихкода.Записать();
	КонецЕсли;
КонецПроцедуры

// Обработчик подписок события справочника перед записью
//
// Параметры:
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//		aps_СправочникСвязейПередЗаписью(Источник, Отказ);
//
Процедура aps_СправочникСвязейПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда 
		Если Источник.Метаданные().Реквизиты.Найти("Дата") <> Неопределено Тогда 
			Источник.Дата = ТекущаяДата();
		КонецЕсли;
		Если Источник.Метаданные().Реквизиты.Найти("ПорядокВывода") <> Неопределено Тогда
			Источник.ПорядокВывода = aps_ПолучитьПоследнийПорядокВывода( Источник.РодительСсылка );
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Или (Источник.ДополнительныеСвойства.Свойство("ПроверитьРекурсивноеВхождение") И Источник.ДополнительныеСвойства.ПроверитьРекурсивноеВхождение=Истина) Тогда 
		Если НЕ Источник.ПометкаУдаления И ТипЗнч(Источник.ВидСвязи)<>Тип("СправочникСсылка.aps_ШаблоныТехнологическихСвязей") Тогда 
			МассивЭлементовДляПроверки = Новый Массив;
			МассивЭлементовДляПроверки.Добавить(Источник.РодительСсылка);
			Если МассивЭлементовДляПроверки[0]=Источник.ПотомокСсылка
					Или Обработки.aps_Применяемость.Создать().aps_ФильтрЭлементовПоПрименяемости(МассивЭлементовДляПроверки, Источник.ПотомокСсылка, Источник.ВидСвязи).Количество() > 0 Тогда 
				ВызватьИсключение НСтр("ru = 'Наблюдается рекурсивное вхождение!'; en_US = 'There are recursive occurrences!'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обработчик подписок события справочника при записи
//
// Параметры:
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//		aps_СправочникСвязейПриЗаписи(Источник, Отказ);
//
Процедура aps_СправочникСвязейПриЗаписи(Источник, Отказ) Экспорт
	//
КонецПроцедуры

// Обработчик события справочника перед записью
//
// Параметры:
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//		aps_СправочниковПараметровПередЗаписью(Источник, Отказ);
//
Процедура aps_СправочниковПараметровПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда
		Источник.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(Источник.Значение)=Тип("Строка") Тогда 
		Источник.Значение=СокрЛП(Источник.Значение);
	КонецЕсли;
КонецПроцедуры

// Обработчик события справочника перед записью
//
// Параметры:
//		Источник - источник события
// 		Отказ - возврат отказа
// Пример:
//		aps_ПриУстановкеНовогоКодаДляСправочникаУПП(Источник, СтандартнаяОбработка, Префикс)
//
Процедура aps_ПриУстановкеНовогоКодаДляСправочникаУПП(Источник, СтандартнаяОбработка, Префикс) Экспорт
	Префикс = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить() + Префикс;
КонецПроцедуры


// Фоновое задание обновления данных информационной базы
//
// Параметры
//		нет
Процедура aps_ОбновлениеДанныхИнформационнойБазы() Экспорт
	Результат=Обработки.aps_Поиск.Создать().aps_Поиск( Новый Структура() );
	aps_ОбновлениеПредставленияЭлементов(Результат.ВыгрузитьКолонку("ЭлементСсылка"));
КонецПроцедуры

// Фоновое задание удаление несвязанных элементов
//
// Параметры
//		нет
Процедура aps_УдалениеНесвязанных() Экспорт
	Если Константы.aps_УдалятьНесвязанныеПараметры.Получить() = Истина Тогда
		aps_УдалениеНесвязанныхПараметров();
	КонецЕсли;
	
	Если Константы.aps_УдалятьНесвязанныеЭлементы.Получить() = Истина Тогда
		aps_УдалениеНесвязанныхЭлементов();
	КонецЕсли;
	
	Если Константы.aps_УдалятьНесвязанныеДескрипторы.Получить() = Истина Тогда
		aps_УдалениеНесвязанныхДескрипторов();
	КонецЕсли;
	
	aps_УдалениеНесвязанныхМоделейВХранилище();
КонецПроцедуры

//Процедура обновляет представление элементов
//
// Параметры:
//		СписокЭлементов - Массив ссылок на элементы
// Пример:
//		aps_ОбновлениеПредставленияЭлементов(Результат.ВыгрузитьКолонку("ЭлементСсылка"));
//
Процедура aps_ОбновлениеПредставленияЭлементов( Знач СписокЭлементов ) Экспорт 
	Если ТипЗнч(СписокЭлементов)<>Тип("Массив") Тогда 
		item=СписокЭлементов;
		СписокЭлементов=Новый Массив;
		СписокЭлементов.Добавить(item);
	КонецЕсли;
	
	Для Каждого item Из СписокЭлементов Цикл
		Если Лев(aps_ФормированиеНаименованияЭлемента(item), 150)=item.Наименование Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			item.ПолучитьОбъект().Записать(); // Вызвать обработчик записи элемента
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// Процедура удаляет несвязанные параметры
//
// Параметры:
//		СписокПараметров - ограничивающий список параметров (необязательный)
//		Интерактивно - флаг интерактивного выполнения (необязательный)
// Пример:
//		aps_УдалениеНесвязанныхПараметров(ПараметрыКУдалению);
//
Процедура aps_УдалениеНесвязанныхПараметров( СписокПараметров = Неопределено, Интерактивно = Истина ) Экспорт
	
	// Получение списка несвязанных параметров
	Если СписокПараметров = Неопределено Тогда
		СписокПараметров = aps_Итераторы.aps_НесвязанныеПараметры().ВыгрузитьКолонку("Параметр");
	КонецЕсли;
	
	// Поиск элементов, у которых в представлении используются несвязанные параметры
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	aps_ЭлементыИзделияПредставление.Ссылка КАК ЭлементСсылка
	               |ИЗ
	               |	Справочник.aps_ЭлементыИзделия.ПредставлениеЭлемента КАК aps_ЭлементыИзделияПредставление
	               |ГДЕ
	               |	aps_ЭлементыИзделияПредставление.Параметр В(&Параметры)
	               |	И (НЕ aps_ЭлементыИзделияПредставление.Ссылка.ПометкаУдаления)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	aps_ЭлементыСправочниковПредставление.Ссылка
	               |ИЗ
	               |	Справочник.aps_ЭлементыСправочников.ПредставлениеЭлемента КАК aps_ЭлементыСправочниковПредставление
	               |ГДЕ
	               |	aps_ЭлементыСправочниковПредставление.Параметр В(&Параметры)
	               |	И (НЕ aps_ЭлементыСправочниковПредставление.Ссылка.ПометкаУдаления)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	aps_ЭлементыТехнологииПредставление.Ссылка
	               |ИЗ
	               |	Справочник.aps_ЭлементыТехнологии.ПредставлениеЭлемента КАК aps_ЭлементыТехнологииПредставление
	               |ГДЕ
	               |	aps_ЭлементыТехнологииПредставление.Параметр В(&Параметры)
	               |	И (НЕ aps_ЭлементыТехнологииПредставление.Ссылка.ПометкаУдаления)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	aps_ЭлементыСправочниковПредставление.Ссылка
	               |ИЗ
	               |	Справочник.aps_ЭлементыСправочников.ПредставлениеЭлементовРесурса КАК aps_ЭлементыСправочниковПредставление
	               |ГДЕ
	               |	aps_ЭлементыСправочниковПредставление.Параметр В(&Параметры)
	               |	И (НЕ aps_ЭлементыСправочниковПредставление.Ссылка.ПометкаУдаления)";
	Запрос.УстановитьПараметр("Параметры", СписокПараметров);
	ЭлементыКОбновлению = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	// Удаление параметров из представления
	Для Каждого item Из ЭлементыКОбновлению Цикл 
		Попытка
			itemObject = item.ПолучитьОбъект();
			
			i = 0;
			Пока i < itemObject.ПредставлениеЭлемента.Количество() Цикл
				Если СписокПараметров.Найти(itemObject.ПредставлениеЭлемента[i].Параметр) <> Неопределено Тогда
					itemObject.ПредставлениеЭлемента.Удалить(i);
				Иначе
					i = i + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если itemObject.Метаданные().ТабличныеЧасти.Найти("ПредставлениеЭлементовРесурса") <> Неопределено Тогда 
				i = 0;
				Пока i < itemObject.ПредставлениеЭлементовРесурса.Количество() Цикл
					Если СписокПараметров.Найти(itemObject.ПредставлениеЭлементовРесурса[i].Параметр) <> Неопределено Тогда
						itemObject.ПредставлениеЭлементовРесурса.Удалить(i);
					Иначе
						i = i + 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			itemObject.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если Интерактивно Тогда 
	#Если Клиент Тогда 
		ФормаИндикатора = ПолучитьОбщуюФорму("aps_ФормаИндикатора",, Новый УникальныйИдентификатор());
		ФормаИндикатора.НадписьПроцесса = НСтр("ru = 'Установка пометок удаления...'; en_US = 'Marking to delete...'");
		ФормаИндикатора.МаксимальноеЗначение = СписокПараметров.Количество();
		ФормаИндикатора.Открыть();
	#КонецЕсли
	КонецЕсли;
	
	// Удаление параметров
	Для Каждого Параметр Из СписокПараметров Цикл
		Попытка
			Параметр.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		Исключение
		КонецПопытки;
		
		Если Интерактивно Тогда 
		#Если Клиент Тогда 
			ФормаИндикатора.ЗначениеИндикатора = ФормаИндикатора.ЗначениеИндикатора + 1;
		#КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	Если Интерактивно Тогда 
	#Если Клиент Тогда 
		ФормаИндикатора.Закрыть();
	#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

// Процедура удаляет несвязанные элементы
//
// Параметры:
//		СписокЭлементов - ограничивающий список элементов (необязательный)
//		Интерактивно - флаг интерактивного выполнения (необязательный)
// Пример:
//		aps_ОбработчикиСобытий.aps_УдалениеНесвязанныхЭлементов(МассивЭлементовКУдалению);
//
Процедура aps_УдалениеНесвязанныхЭлементов( СписокЭлементов = Неопределено, Интерактивно = Истина  ) Экспорт
	
	// Получение списка несвязанных элементов
	Если СписокЭлементов = Неопределено Тогда
		СписокЭлементов = aps_Итераторы.aps_НесвязанныеЭлементы(, Константы.aps_ИгнорироватьНесвязанныеРевизии.Получить()).ВыгрузитьКолонку("ЭлементСсылка");
	КонецЕсли;
	
	ВертикальныеСвязиПапок	= aps_Итераторы.aps_ВертикальныеСвязиПапок( СписокЭлементов );
	ЭлементныеСвязи			= aps_Итераторы.aps_ЭлементныеСвязи( СписокЭлементов );
	
	ЭлементныеСвязиОтСвязи	= aps_Итераторы.aps_ЭлементныеСвязи( ЭлементныеСвязи.ВыгрузитьКолонку("ЭлементСвязи") );
	
	Если Интерактивно Тогда 
	#Если Клиент Тогда 
		ФормаИндикатора = ПолучитьОбщуюФорму("aps_ФормаИндикатора",, Новый УникальныйИдентификатор());
		ФормаИндикатора.НадписьПроцесса = НСтр("ru = 'Установка пометок удаления...'; en_US = 'Marking to delete...'");
		ФормаИндикатора.МаксимальноеЗначение = СписокЭлементов.Количество();
		ФормаИндикатора.Открыть();
	#КонецЕсли
	КонецЕсли;

	СписокПараметров = Новый Массив();
	
	Для Каждого item Из СписокЭлементов Цикл
		Попытка
			НачатьТранзакцию();
			
				item.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				
				Для Каждого СтрокаПараметра Из item.Параметры Цикл 
					СписокПараметров.Добавить(СтрокаПараметра.Параметр);
					СписокПараметров.Добавить(СтрокаПараметра.Параметр.Родитель);
				КонецЦикла;
				
				Если item.Метаданные().ТабличныеЧасти.Найти("ПараметрыЭлементовРесурса") <> Неопределено Тогда 
					Для Каждого СтрокаПараметра Из item.ПараметрыЭлементовРесурса Цикл 
						СписокПараметров.Добавить(СтрокаПараметра.Параметр);
						СписокПараметров.Добавить(СтрокаПараметра.Параметр.Родитель);
					КонецЦикла;
				КонецЕсли;

				
				// Пометить на удаление связи от этого элемента
				СтруктураОтбора = Новый Структура("РодительСсылка", item);
				
				СвязиКУдалению = ВертикальныеСвязиПапок.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаСвязи Из СвязиКУдалению Цикл 
					СтрокаСвязи.ЭлементСвязи.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				КонецЦикла;
				
				СвязиКУдалению = ЭлементныеСвязи.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаСвязи Из СвязиКУдалению Цикл 
					СтрокаСвязи.ЭлементСвязи.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Для Каждого СтрокаПараметра Из СтрокаСвязи.ПараметрыЭлементаСвязи Цикл 
						СписокПараметров.Добавить(СтрокаПараметра.Параметр);
						СписокПараметров.Добавить(СтрокаПараметра.ГруппаПараметров);
					КонецЦикла;
					
					// найти и удалить элементные связи от связи
					СвязиОтСвязиКУдалению = ЭлементныеСвязиОтСвязи.НайтиСтроки(Новый Структура("РодительСсылка", СтрокаСвязи.ЭлементСвязи));
					Для Каждого СтрокаСвязиОтСвязи Из СвязиОтСвязиКУдалению Цикл 
						СвязиКУдалению.Добавить(СтрокаСвязиОтСвязи);
					КонецЦикла;
				КонецЦикла;
				
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Сообщить(ПараметрыСеанса.aps_ИмяПродукта + НСтр("ru = 'Не удалось удалить несвязанный элемент:'; en_US = 'Cannot delete the unlinked item:'") + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
		
		Если Интерактивно Тогда 
		#Если Клиент Тогда 
			ФормаИндикатора.ЗначениеИндикатора = ФормаИндикатора.ЗначениеИндикатора + 1;
		#КонецЕсли
		КонецЕсли;
	
	КонецЦикла;
	
	Если Интерактивно Тогда 
	#Если Клиент Тогда 
		ФормаИндикатора.Закрыть();
	#КонецЕсли
	КонецЕсли;

	
	// Пометить на удаление несвязанные параметры
	ПараметрыКУдалению = aps_Итераторы.aps_НесвязанныеПараметры(, СписокПараметров).ВыгрузитьКолонку("Параметр");
	aps_УдалениеНесвязанныхПараметров(ПараметрыКУдалению);
	
КонецПроцедуры

// Процедура удаляет несвязанные параметры
//
// Параметры:
//		СписокДескрипторов - ограничивающий список параметров (необязательный)
// Пример:
//		aps_УдалениеНесвязанныхДескрипторов();
//
Процедура aps_УдалениеНесвязанныхДескрипторов( СписокДескрипторов = Неопределено ) Экспорт
	
	// Получение списка несвязанных дескрипторов
	Если СписокДескрипторов = Неопределено Тогда
		СписокДескрипторов = aps_Итераторы.aps_НесвязанныеДескрипторы().ВыгрузитьКолонку("Дескриптор");
	КонецЕсли;
	
	#Если Клиент Тогда 
		ФормаИндикатора = ПолучитьОбщуюФорму("aps_ФормаИндикатора",, Новый УникальныйИдентификатор());
		ФормаИндикатора.НадписьПроцесса = НСтр("ru = 'Установка пометок удаления...'; en_US = 'Marking to delete...'");
		ФормаИндикатора.МаксимальноеЗначение = СписокДескрипторов.Количество();
		ФормаИндикатора.Открыть();
	#КонецЕсли
	
	// Удаление дескрипторов
	Для Каждого Дескриптор Из СписокДескрипторов Цикл
		Попытка
			Дескриптор.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		Исключение
		КонецПопытки;
		
		#Если Клиент Тогда 
			ФормаИндикатора.ЗначениеИндикатора = ФормаИндикатора.ЗначениеИндикатора + 1;
		#КонецЕсли
	КонецЦикла;
	
	#Если Клиент Тогда 
		ФормаИндикатора.Закрыть();
	#КонецЕсли
	
КонецПроцедуры

// Процедура удаляет несвязанные xdto-модели в хранилище (справочнике)
//
// Параметры:
//		Нет
//
Процедура aps_УдалениеНесвязанныхМоделейВХранилище() Экспорт
	
	СписокМоделей = aps_Итераторы.aps_НесвязанныеМоделиXDTO().ВыгрузитьКолонку("ХранилищеМодели");
	
	#Если Клиент Тогда 
		ФормаИндикатора = ПолучитьОбщуюФорму("aps_ФормаИндикатора",, Новый УникальныйИдентификатор());
		ФормаИндикатора.НадписьПроцесса = НСтр("ru = 'Установка пометок удаления...'; en_US = 'Marking to delete...'");
		ФормаИндикатора.МаксимальноеЗначение = СписокМоделей.Количество();
		ФормаИндикатора.Открыть();
	#КонецЕсли
	
	Для Каждого ХранилищеМодели Из СписокМоделей Цикл
		Попытка
			ХранилищеМодели.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		Исключение
		КонецПопытки;
		
		#Если Клиент Тогда 
			ФормаИндикатора.ЗначениеИндикатора = ФормаИндикатора.ЗначениеИндикатора + 1;
		#КонецЕсли
	
	КонецЦикла;
	
	#Если Клиент Тогда 
		ФормаИндикатора.Закрыть();
	#КонецЕсли
	
КонецПроцедуры

// Фоновое задание создания элементов номенклатуры
//
// Параметры:
//		нет
//
Процедура aps_СозданиеНоменклатуры() Экспорт
	
	МодульСозданияОбъектов	 = Обработки.aps_СозданиеОбъектов.Создать();
	МодульСозданияПараметров = Обработки.aps_СозданиеПараметров.Создать();
	МодульПравДоступа		 = Обработки.aps_ПраваДоступа.Создать();
	
	Если Константы.aps_ОбновлятьСозданнуюНоменклатуру.Получить()=Истина Тогда 
		
		тзСвойстваДляПоиска = Новый ТаблицаЗначений();
		тзСвойстваДляПоиска.Колонки.Добавить("Свойство");
		тзСвойстваДляПоиска.Колонки.Добавить("ВидСравнения");
		тзСвойстваДляПоиска.Колонки.Добавить("Значение");
		
		СвойствоДляПоиска = тзСвойстваДляПоиска.Добавить();
		СвойствоДляПоиска.Свойство		= ПланыВидовХарактеристик.aps_Свойства.Номенклатура;
		СвойствоДляПоиска.Значение		= Справочники.Номенклатура.ПустаяСсылка();
		СвойствоДляПоиска.ВидСравнения	= ВидСравнения.НеРавно;
		
		СтруктураУсловийПоиска = Новый Структура("СвойстваДляПоиска", тзСвойстваДляПоиска);
		РезультатыПоиска = Обработки.aps_Поиск.Создать().aps_Поиск(СтруктураУсловийПоиска);
		
		Для Каждого СтрокаРезультата Из РезультатыПоиска Цикл
			item = СтрокаРезультата.ЭлементСсылка;
			Если ПустаяСтрока(СокрЛП(item.Наименование)) Тогда 
				Продолжить;
			КонецЕсли;
			
			// Не обновлять наименование номенклатры для ревизий изменения
			Если ЗначениеЗаполнено(item.ОригиналРевизии) 
					И МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойству(item, ПланыВидовХарактеристик.aps_Свойства.СпособСозданияРевизии).Значение=Справочники.aps_СпособыСозданияРевизий.Изменение Тогда 
				Продолжить;
			КонецЕсли;
			
			ЭлементНоменклатуры=МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойству(item, ПланыВидовХарактеристик.aps_Свойства.Номенклатура).Значение;
			Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры)
					ИЛИ (ЭлементНоменклатуры.Наименование = item.Наименование И ЭлементНоменклатуры.НаименованиеПолное = item.Наименование) Тогда 
				Продолжить;
			КонецЕсли;

			Попытка
				ОбъектНоменклатуры=ЭлементНоменклатуры.ПолучитьОбъект();
				ОбъектНоменклатуры.Наименование=item.Наименование;
				ОбъектНоменклатуры.НаименованиеПолное=item.Наименование;
				ОбъектНоменклатуры.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("PDM",УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Элемент <'; en_US = 'The <'")+item.Наименование+НСтр("ru = '>. Невозможно обновить позицию номенклатуры:'; en_US = '> item. Cannot update the nomenclature item:'")+Символы.ПС+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли; // Если Константы.aps_ОбновлятьСозданнуюНоменклатуру.Получить()=Истина Тогда 
	
	
	Если Константы.aps_СоздаватьНоменклатуру.Получить()=Истина Тогда 
	
		тзСвойстваДляПоиска = Новый ТаблицаЗначений();
		тзСвойстваДляПоиска.Колонки.Добавить("Свойство");
		тзСвойстваДляПоиска.Колонки.Добавить("ВидСравнения");
		тзСвойстваДляПоиска.Колонки.Добавить("Значение");
		
		СвойствоДляПоиска = тзСвойстваДляПоиска.Добавить();
		СвойствоДляПоиска.Свойство		= ПланыВидовХарактеристик.aps_Свойства.Номенклатура;
		СвойствоДляПоиска.Значение		= Справочники.Номенклатура.ПустаяСсылка();
		СвойствоДляПоиска.ВидСравнения	= ВидСравнения.Равно;
		
		СтруктураУсловийПоиска = Новый Структура("СвойстваДляПоиска", тзСвойстваДляПоиска);
		РезультатыПоиска = Обработки.aps_Поиск.Создать().aps_Поиск(СтруктураУсловийПоиска);
		
		Для Каждого СтрокаРезультата Из РезультатыПоиска Цикл
			item = СтрокаРезультата.ЭлементСсылка;
			Если ПустаяСтрока(СокрЛП(item.Наименование)) Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураПолейНоменклатуры=Новый Структура();
			СтруктураПолейНоменклатуры.Вставить("Наименование"		, item.Наименование);
			СтруктураПолейНоменклатуры.Вставить("НаименованиеПолное", item.Наименование);
			
			ЭлементНоменклатуры=Справочники.Номенклатура.НайтиПоНаименованию(item.Наименование, Истина);
			Если ЭлементНоменклатуры.Пустая() ИЛИ ЭлементНоменклатуры.ПометкаУдаления Тогда 
				Попытка
					ЭлементНоменклатуры=МодульСозданияОбъектов.aps_СозданиеПозицииНоменклатуры(СтруктураПолейНоменклатуры, item, Ложь);
				Исключение
					ЗаписьЖурналаРегистрации("PDM",УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Элемент <'; en_US = 'The <'")+item.Наименование+НСтр("ru = '>. Невозможно создать позицию номенклатуры:'; en_US = '> item. Cannot create a nomenclature item:'")+Символы.ПС+ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
			КонецЕсли;
			
			Попытка
				ПараметрНоменклатура = МодульСозданияПараметров.aps_ВспомНайтиПараметрПоСвойству(item, ПланыВидовХарактеристик.aps_Свойства.Номенклатура);
				Если НЕ МодульПравДоступа.aps_ПроверитьОбъектПрава(Справочники.aps_Права.Изменение, ПараметрНоменклатура, ПараметрНоменклатура.GMOD) Тогда 
					ВызватьИсключение НСтр("ru = 'Отсутствует право изменения параметра!'; en_US = 'Change permission of the parameter is missing!'");
				КонецЕсли;
				
				// связать элемент с номенклатурой
				itemObject = item.ПолучитьОбъект();
				МодульСозданияПараметров.aps_УстановкаПараметра(itemObject, ПланыВидовХарактеристик.aps_Свойства.Номенклатура, ЭлементНоменклатуры);
				itemObject.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("PDM",УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Элемент <'; en_US = 'The <'")+item.Наименование+НСтр("ru = '>. Невозможно связать элемент с номенклатурой:'; en_US = '> item. Cannot link item to nomenclature:'")+Символы.ПС+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли; // Если Константы.aps_СоздаватьНоменклатуру.Получить()=Истина Тогда 
	
КонецПроцедуры

// Фоновое задание выполнения поручений, срок которых истек
//
// Параметры:
//		нет
//
Процедура aps_ВыполнениеПоручений() Экспорт
	// найти все поручения, которые еще не выполнены
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	aps_Поручение.Ссылка
	                      |ИЗ
	                      |	Задача.aps_Поручение КАК aps_Поручение
	                      |ГДЕ
	                      |	НЕ aps_Поручение.ПометкаУдаления
	                      |	И НЕ aps_Поручение.Выполнена
	                      |	И (aps_Поручение.СрокСогласования <> ДАТАВРЕМЯ(1, 1, 1)
	                      |			ИЛИ aps_Поручение.СрокОтправкиЗаместителю <> ДАТАВРЕМЯ(1, 1, 1))");
	МассивПоручений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого ПоручениеСсылка Из МассивПоручений Цикл					  
		ПоручениеОбъект = ПоручениеСсылка.ПолучитьОбъект();
		Если ПоручениеОбъект.ПроверитьВыполнение() Тогда 
			ПоручениеОбъект.ВыполнитьЗадачу();
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

// Фоновое задание рассылки электронных писем по событиям
//
// Параметры:
//		нет
//
Процедура aps_РассылкаПоЖурналу() Экспорт
	Если Константы.aps_РассылкаВключена.Получить()<>Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросСобытийРассылки=Новый Запрос("ВЫБРАТЬ
	                                   |	aps_События.Ссылка
	                                   |ИЗ
	                                   |	Справочник.aps_События КАК aps_События
	                                   |ГДЕ
	                                   |	НЕ aps_События.ПометкаУдаления
	                                   |	И aps_События.РассылкаВключена");
	МассивОбрабатываемыхСобытий=ЗапросСобытийРассылки.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Для i=0 По МассивОбрабатываемыхСобытий.Количество()-1 Цикл 
		МассивОбрабатываемыхСобытий[i]="APPIUS.PDM.Событие."+Строка(МассивОбрабатываемыхСобытий[i].УникальныйИдентификатор());
	КонецЦикла;
	
	Если МассивОбрабатываемыхСобытий.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;
				  

	ДатаПоследнейРассылки=Константы.aps_ДатаПоследнейРассылки.Получить();
	ТаблицаЗнч=Новый ТаблицаЗначений();
	
	ВыгрузитьЖурналРегистрации(ТаблицаЗнч, 
				Новый Структура("ДатаНачала,ДатаОкончания,Событие",ДатаПоследнейРассылки,ТекущаяДата(),
				МассивОбрабатываемыхСобытий),"Дата,Пользователь,Компьютер,Событие,Данные,Комментарий");
	
	
	// получаем настройку почтовой рассылки
	Попытка
		НастройкаПочты=Константы.aps_НастройкаПочтыДляУведомлений.Получить();
	Исключение
		Возврат
	КонецПопытки;
	
	Попытка
		Почта = Новый ИнтернетПочта;
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP = НастройкаПочты.АдресСервераSMTP;
		Профиль.ПортSMTP = НастройкаПочты.ПортSMTP;
		
		Если НастройкаПочты.ТребуетсяSMTPАутентификация Тогда
			Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
			Профиль.ПарольSMTP = НастройкаПочты.ПарольSMTP;
			Профиль.ПользовательSMTP = НастройкаПочты.ИмяПользователяSMTP;
		Иначе
			Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации
		КонецЕсли;
		Почта.Подключиться(Профиль);
	Исключение
		ЗаписьЖурналаРегистрации("APPIUS.PDM.Авторассылка",УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Неверные настройки почты!'; en_US = 'Incorrect mail settings!'"));
		Возврат;
	КонецПопытки;
	
	// Получить события для выполнения
	Для Каждого СтрокаТаблицыЗнч Из ТаблицаЗнч Цикл
		aps_СтруктураПараметровОповещения=Новый Структура("Дата,Пользователь,Компьютер,Событие,Данные,Комментарий,Почта,НастройкаПочты",
															СтрокаТаблицыЗнч.Дата,
															СтрокаТаблицыЗнч.Пользователь,
															СтрокаТаблицыЗнч.Компьютер,
															СтрокаТаблицыЗнч.Событие,
															СтрокаТаблицыЗнч.Данные,
															СтрокаТаблицыЗнч.Комментарий, 
															Почта,
															НастройкаПочты);
															
		Событие=Справочники.aps_События.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗаменить(СтрокаТаблицыЗнч.Событие, "APPIUS.PDM.Событие.", "")));
		
		Попытка
			Выполнить Событие.КодРассылки;
		Исключение
			ЗаписьЖурналаРегистрации("APPIUS.PDM.Авторассылка",УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Ошибка при выполнении фрагмента кода в событии ""'; en_US = 'Error on code fragment executing in ""'")+Строка(Событие)+НСтр("ru = '"":'; en_US = '"" event:'")+Символы.ПС+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	Константы.aps_ДатаПоследнейРассылки.Установить( ТекущаяДата() );
КонецПроцедуры

#КонецОбласти

#КонецЕсли
